### Terraform Plan Results

#### GitHub OIDC Stack ✅
**Status:** Success

<details><summary>Show Plan</summary>

```hcl
Error reading plan: ENOENT: no such file or directory, open 'environments/aws/root/deployment/github-oidc/tfplan.txt'
```

</details>

#### Dev Infrastructure (VPC + EKS Clusters) ✅
**Status:** Success

<details><summary>Show Plan</summary>

```hcl
10:03:37.943 STDOUT terraform: Terraform used the selected providers to generate the following execution
10:03:37.943 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
10:03:37.943 STDOUT terraform:   + create
10:03:37.943 STDOUT terraform:  <= read (data resources)
10:03:37.943 STDOUT terraform: Terraform will perform the following actions:
10:03:37.943 STDOUT terraform:   # module.eks_apps.data.tls_certificate.cluster will be read during apply
10:03:37.943 STDOUT terraform:   # (config refers to values not yet known)
10:03:37.943 STDOUT terraform:  <= data "tls_certificate" "cluster" {
10:03:37.943 STDOUT terraform:       + certificates = (known after apply)
10:03:37.944 STDOUT terraform:       + id           = (known after apply)
10:03:37.944 STDOUT terraform:       + url          = (known after apply)
10:03:37.944 STDOUT terraform:     }
10:03:37.944 STDOUT terraform:   # module.eks_apps.aws_eks_cluster.main will be created
10:03:37.944 STDOUT terraform:   + resource "aws_eks_cluster" "main" {
10:03:37.944 STDOUT terraform:       + arn                           = (known after apply)
10:03:37.944 STDOUT terraform:       + bootstrap_self_managed_addons = true
10:03:37.944 STDOUT terraform:       + certificate_authority         = (known after apply)
10:03:37.944 STDOUT terraform:       + cluster_id                    = (known after apply)
10:03:37.944 STDOUT terraform:       + created_at                    = (known after apply)
10:03:37.944 STDOUT terraform:       + deletion_protection           = (known after apply)
10:03:37.944 STDOUT terraform:       + endpoint                      = (known after apply)
10:03:37.944 STDOUT terraform:       + id                            = (known after apply)
10:03:37.944 STDOUT terraform:       + identity                      = (known after apply)
10:03:37.944 STDOUT terraform:       + name                          = "dev-apps-cluster"
10:03:37.944 STDOUT terraform:       + platform_version              = (known after apply)
10:03:37.944 STDOUT terraform:       + region                        = "eu-west-1"
10:03:37.944 STDOUT terraform:       + role_arn                      = (known after apply)
10:03:37.944 STDOUT terraform:       + status                        = (known after apply)
10:03:37.944 STDOUT terraform:       + tags                          = {
10:03:37.944 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.944 STDOUT terraform:           + "Environment" = "dev"
10:03:37.944 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.944 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.944 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.944 STDOUT terraform:         }
10:03:37.944 STDOUT terraform:       + tags_all                      = {
10:03:37.944 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.944 STDOUT terraform:           + "Environment" = "dev"
10:03:37.944 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.944 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.944 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.944 STDOUT terraform:         }
10:03:37.944 STDOUT terraform:       + version                       = "1.34"
10:03:37.944 STDOUT terraform:       + access_config (known after apply)
10:03:37.944 STDOUT terraform:       + compute_config (known after apply)
10:03:37.945 STDOUT terraform:       + control_plane_scaling_config (known after apply)
10:03:37.945 STDOUT terraform:       + kubernetes_network_config (known after apply)
10:03:37.945 STDOUT terraform:       + storage_config (known after apply)
10:03:37.945 STDOUT terraform:       + upgrade_policy (known after apply)
10:03:37.945 STDOUT terraform:       + vpc_config {
10:03:37.945 STDOUT terraform:           + cluster_security_group_id = (known after apply)
10:03:37.945 STDOUT terraform:           + endpoint_private_access   = true
10:03:37.945 STDOUT terraform:           + endpoint_public_access    = true
10:03:37.945 STDOUT terraform:           + public_access_cidrs       = (known after apply)
10:03:37.945 STDOUT terraform:           + security_group_ids        = (known after apply)
10:03:37.945 STDOUT terraform:           + subnet_ids                = (known after apply)
10:03:37.945 STDOUT terraform:           + vpc_id                    = (known after apply)
10:03:37.945 STDOUT terraform:         }
10:03:37.945 STDOUT terraform:     }
10:03:37.945 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.app_namespaces["default"] will be created
10:03:37.945 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
10:03:37.945 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.945 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
10:03:37.945 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-default"
10:03:37.945 STDOUT terraform:       + id                     = (known after apply)
10:03:37.945 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.945 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.945 STDOUT terraform:       + status                 = (known after apply)
10:03:37.945 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.945 STDOUT terraform:       + tags                   = {
10:03:37.945 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.945 STDOUT terraform:           + "Environment" = "dev"
10:03:37.945 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.945 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.945 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.945 STDOUT terraform:         }
10:03:37.945 STDOUT terraform:       + tags_all               = {
10:03:37.945 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.945 STDOUT terraform:           + "Environment" = "dev"
10:03:37.945 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.945 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.946 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.946 STDOUT terraform:         }
10:03:37.946 STDOUT terraform:       + selector {
10:03:37.946 STDOUT terraform:           + namespace = "default"
10:03:37.946 STDOUT terraform:         }
10:03:37.946 STDOUT terraform:     }
10:03:37.946 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.app_namespaces["production"] will be created
10:03:37.946 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
10:03:37.946 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.946 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
10:03:37.946 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-production"
10:03:37.946 STDOUT terraform:       + id                     = (known after apply)
10:03:37.946 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.946 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.946 STDOUT terraform:       + status                 = (known after apply)
10:03:37.946 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.946 STDOUT terraform:       + tags                   = {
10:03:37.946 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.946 STDOUT terraform:           + "Environment" = "dev"
10:03:37.946 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.946 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.946 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.946 STDOUT terraform:         }
10:03:37.946 STDOUT terraform:       + tags_all               = {
10:03:37.946 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.946 STDOUT terraform:           + "Environment" = "dev"
10:03:37.946 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.946 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.946 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.946 STDOUT terraform:         }
10:03:37.946 STDOUT terraform:       + selector {
10:03:37.946 STDOUT terraform:           + namespace = "production"
10:03:37.946 STDOUT terraform:         }
10:03:37.946 STDOUT terraform:     }
10:03:37.946 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.app_namespaces["staging"] will be created
10:03:37.946 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
10:03:37.946 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.946 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
10:03:37.947 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-staging"
10:03:37.947 STDOUT terraform:       + id                     = (known after apply)
10:03:37.947 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.947 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.947 STDOUT terraform:       + status                 = (known after apply)
10:03:37.947 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.947 STDOUT terraform:       + tags                   = {
10:03:37.947 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.947 STDOUT terraform:           + "Environment" = "dev"
10:03:37.947 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.947 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.947 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.947 STDOUT terraform:         }
10:03:37.947 STDOUT terraform:       + tags_all               = {
10:03:37.947 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.947 STDOUT terraform:           + "Environment" = "dev"
10:03:37.947 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.947 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.947 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.947 STDOUT terraform:         }
10:03:37.947 STDOUT terraform:       + selector {
10:03:37.947 STDOUT terraform:           + namespace = "staging"
10:03:37.947 STDOUT terraform:         }
10:03:37.947 STDOUT terraform:     }
10:03:37.947 STDOUT terraform:   # module.eks_apps.aws_eks_fargate_profile.kube_system will be created
10:03:37.947 STDOUT terraform:   + resource "aws_eks_fargate_profile" "kube_system" {
10:03:37.947 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.947 STDOUT terraform:       + cluster_name           = "dev-apps-cluster"
10:03:37.947 STDOUT terraform:       + fargate_profile_name   = "dev-apps-cluster-kube-system"
10:03:37.947 STDOUT terraform:       + id                     = (known after apply)
10:03:37.947 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.947 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.947 STDOUT terraform:       + status                 = (known after apply)
10:03:37.947 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.947 STDOUT terraform:       + tags                   = {
10:03:37.947 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.947 STDOUT terraform:           + "Environment" = "dev"
10:03:37.947 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.947 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.947 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.947 STDOUT terraform:         }
10:03:37.947 STDOUT terraform:       + tags_all               = {
10:03:37.947 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.947 STDOUT terraform:           + "Environment" = "dev"
10:03:37.947 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.948 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.948 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.948 STDOUT terraform:         }
10:03:37.948 STDOUT terraform:       + selector {
10:03:37.948 STDOUT terraform:           + namespace = "kube-system"
10:03:37.948 STDOUT terraform:         }
10:03:37.948 STDOUT terraform:     }
10:03:37.948 STDOUT terraform:   # module.eks_apps.aws_iam_openid_connect_provider.cluster will be created
10:03:37.948 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "cluster" {
10:03:37.948 STDOUT terraform:       + arn             = (known after apply)
10:03:37.948 STDOUT terraform:       + client_id_list  = [
10:03:37.948 STDOUT terraform:           + "sts.amazonaws.com",
10:03:37.948 STDOUT terraform:         ]
10:03:37.948 STDOUT terraform:       + id              = (known after apply)
10:03:37.948 STDOUT terraform:       + tags            = {
10:03:37.948 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.948 STDOUT terraform:           + "Environment" = "dev"
10:03:37.948 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.948 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.948 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.948 STDOUT terraform:         }
10:03:37.948 STDOUT terraform:       + tags_all        = {
10:03:37.948 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.948 STDOUT terraform:           + "Environment" = "dev"
10:03:37.948 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.948 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.948 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.948 STDOUT terraform:         }
10:03:37.948 STDOUT terraform:       + thumbprint_list = (known after apply)
10:03:37.948 STDOUT terraform:       + url             = (known after apply)
10:03:37.948 STDOUT terraform:     }
10:03:37.948 STDOUT terraform:   # module.eks_apps.aws_iam_policy.aws_load_balancer_controller[0] will be created
10:03:37.948 STDOUT terraform:   + resource "aws_iam_policy" "aws_load_balancer_controller" {
10:03:37.948 STDOUT terraform:       + arn              = (known after apply)
10:03:37.948 STDOUT terraform:       + attachment_count = (known after apply)
10:03:37.948 STDOUT terraform:       + description      = "IAM policy for AWS Load Balancer Controller"
10:03:37.948 STDOUT terraform:       + id               = (known after apply)
10:03:37.948 STDOUT terraform:       + name             = "dev-apps-cluster-aws-lb-controller-policy"
10:03:37.948 STDOUT terraform:       + name_prefix      = (known after apply)
10:03:37.948 STDOUT terraform:       + path             = "/"
10:03:37.948 STDOUT terraform:       + policy           = jsonencode(
10:03:37.948 STDOUT terraform:             {
10:03:37.948 STDOUT terraform:               + Statement = [
10:03:37.948 STDOUT terraform:                   + {
10:03:37.948 STDOUT terraform:                       + Action    = [
10:03:37.948 STDOUT terraform:                           + "iam:CreateServiceLinkedRole",
10:03:37.948 STDOUT terraform:                         ]
10:03:37.948 STDOUT terraform:                       + Condition = {
10:03:37.948 STDOUT terraform:                           + StringEquals = {
10:03:37.948 STDOUT terraform:                               + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
10:03:37.948 STDOUT terraform:                             }
10:03:37.948 STDOUT terraform:                         }
10:03:37.948 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.948 STDOUT terraform:                       + Resource  = "*"
10:03:37.948 STDOUT terraform:                     },
10:03:37.948 STDOUT terraform:                   + {
10:03:37.948 STDOUT terraform:                       + Action   = [
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeAccountAttributes",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeAddresses",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeAvailabilityZones",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeVpcs",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeSubnets",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeInstances",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
10:03:37.948 STDOUT terraform:                           + "ec2:DescribeTags",
10:03:37.948 STDOUT terraform:                           + "ec2:GetCoipPoolUsage",
10:03:37.949 STDOUT terraform:                           + "ec2:DescribeCoipPools",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancers",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancerAttributes",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeListeners",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeListenerCertificates",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeSSLPolicies",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeRules",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroups",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroupAttributes",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetHealth",
10:03:37.949 STDOUT terraform:                           + "elasticloadbalancing:DescribeTags",
10:03:37.949 STDOUT terraform:                         ]
10:03:37.949 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.949 STDOUT terraform:                       + Resource = "*"
10:03:37.949 STDOUT terraform:                     },
10:03:37.949 STDOUT terraform:                   + {
10:03:37.949 STDOUT terraform:                       + Action   = [
10:03:37.949 STDOUT terraform:                           + "cognito-idp:DescribeUserPoolClient",
10:03:37.949 STDOUT terraform:                           + "acm:ListCertificates",
10:03:37.949 STDOUT terraform:                           + "acm:DescribeCertificate",
10:03:37.949 STDOUT terraform:                           + "iam:ListServerCertificates",
10:03:37.949 STDOUT terraform:                           + "iam:GetServerCertificate",
10:03:37.949 STDOUT terraform:                           + "waf-regional:GetWebACL",
10:03:37.949 STDOUT terraform:                           + "waf-regional:GetWebACLForResource",
10:03:37.949 STDOUT terraform:                           + "waf-regional:AssociateWebACL",
10:03:37.949 STDOUT terraform:                           + "waf-regional:DisassociateWebACL",
10:03:37.949 STDOUT terraform:                           + "wafv2:GetWebACL",
10:03:37.949 STDOUT terraform:                           + "wafv2:GetWebACLForResource",
10:03:37.949 STDOUT terraform:                           + "wafv2:AssociateWebACL",
10:03:37.949 STDOUT terraform:                           + "wafv2:DisassociateWebACL",
10:03:37.949 STDOUT terraform:                           + "shield:GetSubscriptionState",
10:03:37.949 STDOUT terraform:                           + "shield:DescribeProtection",
10:03:37.949 STDOUT terraform:                           + "shield:CreateProtection",
10:03:37.949 STDOUT terraform:                           + "shield:DeleteProtection",
10:03:37.949 STDOUT terraform:                         ]
10:03:37.949 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.949 STDOUT terraform:                       + Resource = "*"
10:03:37.949 STDOUT terraform:                     },
10:03:37.949 STDOUT terraform:                   + {
10:03:37.949 STDOUT terraform:                       + Action   = [
10:03:37.949 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
10:03:37.949 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
10:03:37.949 STDOUT terraform:                         ]
10:03:37.949 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.949 STDOUT terraform:                       + Resource = "*"
10:03:37.949 STDOUT terraform:                     },
10:03:37.949 STDOUT terraform:                   + {
10:03:37.949 STDOUT terraform:                       + Action   = [
10:03:37.949 STDOUT terraform:                           + "ec2:CreateSecurityGroup",
10:03:37.949 STDOUT terraform:                         ]
10:03:37.949 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.949 STDOUT terraform:                       + Resource = "*"
10:03:37.949 STDOUT terraform:                     },
10:03:37.949 STDOUT terraform:                   + {
10:03:37.949 STDOUT terraform:                       + Action    = [
10:03:37.949 STDOUT terraform:                           + "ec2:CreateTags",
10:03:37.949 STDOUT terraform:                         ]
10:03:37.949 STDOUT terraform:                       + Condition = {
10:03:37.949 STDOUT terraform:                           + Null         = {
10:03:37.949 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.949 STDOUT terraform:                             }
10:03:37.949 STDOUT terraform:                           + StringEquals = {
10:03:37.949 STDOUT terraform:                               + "ec2:CreateAction" = "CreateSecurityGroup"
10:03:37.950 STDOUT terraform:                             }
10:03:37.950 STDOUT terraform:                         }
10:03:37.950 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.950 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
10:03:37.950 STDOUT terraform:                     },
10:03:37.950 STDOUT terraform:                   + {
10:03:37.950 STDOUT terraform:                       + Action    = [
10:03:37.950 STDOUT terraform:                           + "ec2:CreateTags",
10:03:37.950 STDOUT terraform:                           + "ec2:DeleteTags",
10:03:37.950 STDOUT terraform:                         ]
10:03:37.950 STDOUT terraform:                       + Condition = {
10:03:37.950 STDOUT terraform:                           + Null = {
10:03:37.950 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
10:03:37.950 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.950 STDOUT terraform:                             }
10:03:37.950 STDOUT terraform:                         }
10:03:37.950 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.950 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
10:03:37.950 STDOUT terraform:                     },
10:03:37.950 STDOUT terraform:                   + {
10:03:37.950 STDOUT terraform:                       + Action    = [
10:03:37.950 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
10:03:37.950 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
10:03:37.950 STDOUT terraform:                           + "ec2:DeleteSecurityGroup",
10:03:37.950 STDOUT terraform:                         ]
10:03:37.950 STDOUT terraform:                       + Condition = {
10:03:37.950 STDOUT terraform:                           + Null = {
10:03:37.950 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.950 STDOUT terraform:                             }
10:03:37.950 STDOUT terraform:                         }
10:03:37.950 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.950 STDOUT terraform:                       + Resource  = "*"
10:03:37.950 STDOUT terraform:                     },
10:03:37.950 STDOUT terraform:                   + {
10:03:37.950 STDOUT terraform:                       + Action    = [
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:CreateLoadBalancer",
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:CreateTargetGroup",
10:03:37.950 STDOUT terraform:                         ]
10:03:37.950 STDOUT terraform:                       + Condition = {
10:03:37.950 STDOUT terraform:                           + Null = {
10:03:37.950 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.950 STDOUT terraform:                             }
10:03:37.950 STDOUT terraform:                         }
10:03:37.950 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.950 STDOUT terraform:                       + Resource  = "*"
10:03:37.950 STDOUT terraform:                     },
10:03:37.950 STDOUT terraform:                   + {
10:03:37.950 STDOUT terraform:                       + Action   = [
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:CreateListener",
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:DeleteListener",
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:CreateRule",
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:DeleteRule",
10:03:37.950 STDOUT terraform:                         ]
10:03:37.950 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.950 STDOUT terraform:                       + Resource = "*"
10:03:37.950 STDOUT terraform:                     },
10:03:37.950 STDOUT terraform:                   + {
10:03:37.950 STDOUT terraform:                       + Action    = [
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
10:03:37.950 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
10:03:37.950 STDOUT terraform:                         ]
10:03:37.950 STDOUT terraform:                       + Condition = {
10:03:37.950 STDOUT terraform:                           + Null = {
10:03:37.950 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
10:03:37.950 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.950 STDOUT terraform:                             }
10:03:37.951 STDOUT terraform:                         }
10:03:37.951 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.951 STDOUT terraform:                       + Resource  = [
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
10:03:37.951 STDOUT terraform:                         ]
10:03:37.951 STDOUT terraform:                     },
10:03:37.951 STDOUT terraform:                   + {
10:03:37.951 STDOUT terraform:                       + Action   = [
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
10:03:37.951 STDOUT terraform:                         ]
10:03:37.951 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.951 STDOUT terraform:                       + Resource = [
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
10:03:37.951 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
10:03:37.951 STDOUT terraform:                         ]
10:03:37.951 STDOUT terraform:                     },
10:03:37.951 STDOUT terraform:                   + {
10:03:37.951 STDOUT terraform:                       + Action    = [
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:ModifyLoadBalancerAttributes",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:SetIpAddressType",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:SetSecurityGroups",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:SetSubnets",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:DeleteLoadBalancer",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroup",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroupAttributes",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:DeleteTargetGroup",
10:03:37.951 STDOUT terraform:                         ]
10:03:37.951 STDOUT terraform:                       + Condition = {
10:03:37.951 STDOUT terraform:                           + Null = {
10:03:37.951 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.951 STDOUT terraform:                             }
10:03:37.951 STDOUT terraform:                         }
10:03:37.951 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.951 STDOUT terraform:                       + Resource  = "*"
10:03:37.951 STDOUT terraform:                     },
10:03:37.951 STDOUT terraform:                   + {
10:03:37.951 STDOUT terraform:                       + Action   = [
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:RegisterTargets",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:DeregisterTargets",
10:03:37.951 STDOUT terraform:                         ]
10:03:37.951 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.951 STDOUT terraform:                       + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
10:03:37.951 STDOUT terraform:                     },
10:03:37.951 STDOUT terraform:                   + {
10:03:37.951 STDOUT terraform:                       + Action   = [
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:SetWebAcl",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:ModifyListener",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:AddListenerCertificates",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:RemoveListenerCertificates",
10:03:37.951 STDOUT terraform:                           + "elasticloadbalancing:ModifyRule",
10:03:37.951 STDOUT terraform:                         ]
10:03:37.951 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.951 STDOUT terraform:                       + Resource = "*"
10:03:37.952 STDOUT terraform:                     },
10:03:37.952 STDOUT terraform:                 ]
10:03:37.952 STDOUT terraform:               + Version   = "2012-10-17"
10:03:37.952 STDOUT terraform:             }
10:03:37.952 STDOUT terraform:         )
10:03:37.952 STDOUT terraform:       + policy_id        = (known after apply)
10:03:37.952 STDOUT terraform:       + tags             = {
10:03:37.952 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.952 STDOUT terraform:           + "Environment" = "dev"
10:03:37.952 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.952 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.952 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.952 STDOUT terraform:         }
10:03:37.952 STDOUT terraform:       + tags_all         = {
10:03:37.952 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.952 STDOUT terraform:           + "Environment" = "dev"
10:03:37.952 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.952 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.952 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.952 STDOUT terraform:         }
10:03:37.952 STDOUT terraform:     }
10:03:37.952 STDOUT terraform:   # module.eks_apps.aws_iam_role.aws_load_balancer_controller[0] will be created
10:03:37.952 STDOUT terraform:   + resource "aws_iam_role" "aws_load_balancer_controller" {
10:03:37.952 STDOUT terraform:       + arn                   = (known after apply)
10:03:37.952 STDOUT terraform:       + assume_role_policy    = (known after apply)
10:03:37.952 STDOUT terraform:       + create_date           = (known after apply)
10:03:37.952 STDOUT terraform:       + force_detach_policies = false
10:03:37.952 STDOUT terraform:       + id                    = (known after apply)
10:03:37.952 STDOUT terraform:       + managed_policy_arns   = (known after apply)
10:03:37.952 STDOUT terraform:       + max_session_duration  = 3600
10:03:37.952 STDOUT terraform:       + name                  = "dev-apps-cluster-aws-lb-controller"
10:03:37.952 STDOUT terraform:       + name_prefix           = (known after apply)
10:03:37.952 STDOUT terraform:       + path                  = "/"
10:03:37.952 STDOUT terraform:       + tags                  = {
10:03:37.952 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.952 STDOUT terraform:           + "Environment" = "dev"
10:03:37.952 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.952 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.952 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.952 STDOUT terraform:         }
10:03:37.952 STDOUT terraform:       + tags_all              = {
10:03:37.952 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.952 STDOUT terraform:           + "Environment" = "dev"
10:03:37.952 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.952 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.952 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.952 STDOUT terraform:         }
10:03:37.952 STDOUT terraform:       + unique_id             = (known after apply)
10:03:37.952 STDOUT terraform:       + inline_policy (known after apply)
10:03:37.952 STDOUT terraform:     }
10:03:37.952 STDOUT terraform:   # module.eks_apps.aws_iam_role.cluster will be created
10:03:37.952 STDOUT terraform:   + resource "aws_iam_role" "cluster" {
10:03:37.952 STDOUT terraform:       + arn                   = (known after apply)
10:03:37.952 STDOUT terraform:       + assume_role_policy    = jsonencode(
10:03:37.952 STDOUT terraform:             {
10:03:37.952 STDOUT terraform:               + Statement = [
10:03:37.952 STDOUT terraform:                   + {
10:03:37.952 STDOUT terraform:                       + Action    = "sts:AssumeRole"
10:03:37.952 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.952 STDOUT terraform:                       + Principal = {
10:03:37.952 STDOUT terraform:                           + Service = "eks.amazonaws.com"
10:03:37.952 STDOUT terraform:                         }
10:03:37.952 STDOUT terraform:                     },
10:03:37.952 STDOUT terraform:                 ]
10:03:37.952 STDOUT terraform:               + Version   = "2012-10-17"
10:03:37.952 STDOUT terraform:             }
10:03:37.952 STDOUT terraform:         )
10:03:37.952 STDOUT terraform:       + create_date           = (known after apply)
10:03:37.952 STDOUT terraform:       + force_detach_policies = false
10:03:37.952 STDOUT terraform:       + id                    = (known after apply)
10:03:37.952 STDOUT terraform:       + managed_policy_arns   = (known after apply)
10:03:37.952 STDOUT terraform:       + max_session_duration  = 3600
10:03:37.952 STDOUT terraform:       + name                  = "dev-apps-cluster-cluster-role"
10:03:37.952 STDOUT terraform:       + name_prefix           = (known after apply)
10:03:37.953 STDOUT terraform:       + path                  = "/"
10:03:37.953 STDOUT terraform:       + tags                  = {
10:03:37.953 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.953 STDOUT terraform:           + "Environment" = "dev"
10:03:37.953 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.953 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.953 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.953 STDOUT terraform:         }
10:03:37.953 STDOUT terraform:       + tags_all              = {
10:03:37.953 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.953 STDOUT terraform:           + "Environment" = "dev"
10:03:37.953 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.953 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.953 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.953 STDOUT terraform:         }
10:03:37.953 STDOUT terraform:       + unique_id             = (known after apply)
10:03:37.953 STDOUT terraform:       + inline_policy (known after apply)
10:03:37.953 STDOUT terraform:     }
10:03:37.953 STDOUT terraform:   # module.eks_apps.aws_iam_role.fargate will be created
10:03:37.953 STDOUT terraform:   + resource "aws_iam_role" "fargate" {
10:03:37.953 STDOUT terraform:       + arn                   = (known after apply)
10:03:37.953 STDOUT terraform:       + assume_role_policy    = jsonencode(
10:03:37.953 STDOUT terraform:             {
10:03:37.953 STDOUT terraform:               + Statement = [
10:03:37.953 STDOUT terraform:                   + {
10:03:37.953 STDOUT terraform:                       + Action    = "sts:AssumeRole"
10:03:37.953 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.953 STDOUT terraform:                       + Principal = {
10:03:37.953 STDOUT terraform:                           + Service = "eks-fargate-pods.amazonaws.com"
10:03:37.953 STDOUT terraform:                         }
10:03:37.953 STDOUT terraform:                     },
10:03:37.953 STDOUT terraform:                 ]
10:03:37.953 STDOUT terraform:               + Version   = "2012-10-17"
10:03:37.953 STDOUT terraform:             }
10:03:37.953 STDOUT terraform:         )
10:03:37.953 STDOUT terraform:       + create_date           = (known after apply)
10:03:37.953 STDOUT terraform:       + force_detach_policies = false
10:03:37.953 STDOUT terraform:       + id                    = (known after apply)
10:03:37.953 STDOUT terraform:       + managed_policy_arns   = (known after apply)
10:03:37.953 STDOUT terraform:       + max_session_duration  = 3600
10:03:37.953 STDOUT terraform:       + name                  = "dev-apps-cluster-fargate-role"
10:03:37.953 STDOUT terraform:       + name_prefix           = (known after apply)
10:03:37.953 STDOUT terraform:       + path                  = "/"
10:03:37.953 STDOUT terraform:       + tags                  = {
10:03:37.953 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.953 STDOUT terraform:           + "Environment" = "dev"
10:03:37.953 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.953 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.953 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.953 STDOUT terraform:         }
10:03:37.953 STDOUT terraform:       + tags_all              = {
10:03:37.953 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.953 STDOUT terraform:           + "Environment" = "dev"
10:03:37.953 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.953 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.953 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.953 STDOUT terraform:         }
10:03:37.953 STDOUT terraform:       + unique_id             = (known after apply)
10:03:37.953 STDOUT terraform:       + inline_policy (known after apply)
10:03:37.953 STDOUT terraform:     }
10:03:37.953 STDOUT terraform:   # module.eks_apps.aws_iam_role_policy_attachment.aws_load_balancer_controller[0] will be created
10:03:37.953 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller" {
10:03:37.953 STDOUT terraform:       + id         = (known after apply)
10:03:37.953 STDOUT terraform:       + policy_arn = (known after apply)
10:03:37.953 STDOUT terraform:       + role       = "dev-apps-cluster-aws-lb-controller"
10:03:37.953 STDOUT terraform:     }
10:03:37.953 STDOUT terraform:   # module.eks_apps.aws_iam_role_policy_attachment.cluster_policy will be created
10:03:37.953 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_policy" {
10:03:37.953 STDOUT terraform:       + id         = (known after apply)
10:03:37.954 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
10:03:37.954 STDOUT terraform:       + role       = "dev-apps-cluster-cluster-role"
10:03:37.954 STDOUT terraform:     }
10:03:37.954 STDOUT terraform:   # module.eks_apps.aws_iam_role_policy_attachment.fargate_pod_execution will be created
10:03:37.954 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "fargate_pod_execution" {
10:03:37.954 STDOUT terraform:       + id         = (known after apply)
10:03:37.954 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
10:03:37.954 STDOUT terraform:       + role       = "dev-apps-cluster-fargate-role"
10:03:37.954 STDOUT terraform:     }
10:03:37.954 STDOUT terraform:   # module.eks_apps.aws_security_group.cluster will be created
10:03:37.954 STDOUT terraform:   + resource "aws_security_group" "cluster" {
10:03:37.954 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.954 STDOUT terraform:       + description            = "Security group for EKS cluster control plane"
10:03:37.954 STDOUT terraform:       + egress                 = [
10:03:37.954 STDOUT terraform:           + {
10:03:37.954 STDOUT terraform:               + cidr_blocks      = [
10:03:37.954 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.954 STDOUT terraform:                 ]
10:03:37.954 STDOUT terraform:               + description      = "Allow all outbound traffic"
10:03:37.954 STDOUT terraform:               + from_port        = 0
10:03:37.954 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.954 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.954 STDOUT terraform:               + protocol         = "-1"
10:03:37.954 STDOUT terraform:               + security_groups  = []
10:03:37.954 STDOUT terraform:               + self             = false
10:03:37.954 STDOUT terraform:               + to_port          = 0
10:03:37.954 STDOUT terraform:             },
10:03:37.954 STDOUT terraform:         ]
10:03:37.954 STDOUT terraform:       + id                     = (known after apply)
10:03:37.954 STDOUT terraform:       + ingress                = (known after apply)
10:03:37.954 STDOUT terraform:       + name                   = "dev-apps-cluster-cluster-sg"
10:03:37.954 STDOUT terraform:       + name_prefix            = (known after apply)
10:03:37.954 STDOUT terraform:       + owner_id               = (known after apply)
10:03:37.954 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.954 STDOUT terraform:       + revoke_rules_on_delete = false
10:03:37.954 STDOUT terraform:       + tags                   = {
10:03:37.954 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.954 STDOUT terraform:           + "Environment" = "dev"
10:03:37.954 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.955 STDOUT terraform:           + "Name"        = "dev-apps-cluster-cluster-sg"
10:03:37.955 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.955 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.955 STDOUT terraform:         }
10:03:37.955 STDOUT terraform:       + tags_all               = {
10:03:37.955 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.955 STDOUT terraform:           + "Environment" = "dev"
10:03:37.955 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.955 STDOUT terraform:           + "Name"        = "dev-apps-cluster-cluster-sg"
10:03:37.955 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.955 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.955 STDOUT terraform:         }
10:03:37.955 STDOUT terraform:       + vpc_id                 = (known after apply)
10:03:37.955 STDOUT terraform:     }
10:03:37.955 STDOUT terraform:   # module.eks_apps.aws_security_group.pods will be created
10:03:37.955 STDOUT terraform:   + resource "aws_security_group" "pods" {
10:03:37.955 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.955 STDOUT terraform:       + description            = "Security group for Fargate pods"
10:03:37.955 STDOUT terraform:       + egress                 = [
10:03:37.955 STDOUT terraform:           + {
10:03:37.955 STDOUT terraform:               + cidr_blocks      = [
10:03:37.955 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.955 STDOUT terraform:                 ]
10:03:37.955 STDOUT terraform:               + description      = "Allow all outbound traffic"
10:03:37.955 STDOUT terraform:               + from_port        = 0
10:03:37.955 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.955 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.955 STDOUT terraform:               + protocol         = "-1"
10:03:37.955 STDOUT terraform:               + security_groups  = []
10:03:37.955 STDOUT terraform:               + self             = false
10:03:37.955 STDOUT terraform:               + to_port          = 0
10:03:37.955 STDOUT terraform:             },
10:03:37.955 STDOUT terraform:         ]
10:03:37.955 STDOUT terraform:       + id                     = (known after apply)
10:03:37.955 STDOUT terraform:       + ingress                = (known after apply)
10:03:37.955 STDOUT terraform:       + name                   = "dev-apps-cluster-pods-sg"
10:03:37.955 STDOUT terraform:       + name_prefix            = (known after apply)
10:03:37.955 STDOUT terraform:       + owner_id               = (known after apply)
10:03:37.955 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.955 STDOUT terraform:       + revoke_rules_on_delete = false
10:03:37.955 STDOUT terraform:       + tags                   = {
10:03:37.955 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.955 STDOUT terraform:           + "Environment" = "dev"
10:03:37.956 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.956 STDOUT terraform:           + "Name"        = "dev-apps-cluster-pods-sg"
10:03:37.956 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.956 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.956 STDOUT terraform:         }
10:03:37.956 STDOUT terraform:       + tags_all               = {
10:03:37.956 STDOUT terraform:           + "Cluster"     = "apps-cluster"
10:03:37.956 STDOUT terraform:           + "Environment" = "dev"
10:03:37.956 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.956 STDOUT terraform:           + "Name"        = "dev-apps-cluster-pods-sg"
10:03:37.956 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.956 STDOUT terraform:           + "Purpose"     = "application-workloads"
10:03:37.956 STDOUT terraform:         }
10:03:37.956 STDOUT terraform:       + vpc_id                 = (known after apply)
10:03:37.956 STDOUT terraform:     }
10:03:37.956 STDOUT terraform:   # module.eks_apps.aws_security_group_rule.alb_to_pods["enabled"] will be created
10:03:37.956 STDOUT terraform:   + resource "aws_security_group_rule" "alb_to_pods" {
10:03:37.956 STDOUT terraform:       + description              = "Allow traffic from ALB"
10:03:37.956 STDOUT terraform:       + from_port                = 0
10:03:37.956 STDOUT terraform:       + id                       = (known after apply)
10:03:37.956 STDOUT terraform:       + protocol                 = "tcp"
10:03:37.956 STDOUT terraform:       + region                   = "eu-west-1"
10:03:37.956 STDOUT terraform:       + security_group_id        = (known after apply)
10:03:37.956 STDOUT terraform:       + security_group_rule_id   = (known after apply)
10:03:37.956 STDOUT terraform:       + self                     = false
10:03:37.956 STDOUT terraform:       + source_security_group_id = (known after apply)
10:03:37.956 STDOUT terraform:       + to_port                  = 65535
10:03:37.956 STDOUT terraform:       + type                     = "ingress"
10:03:37.956 STDOUT terraform:     }
10:03:37.956 STDOUT terraform:   # module.eks_mgmt.data.tls_certificate.cluster will be read during apply
10:03:37.956 STDOUT terraform:   # (config refers to values not yet known)
10:03:37.956 STDOUT terraform:  <= data "tls_certificate" "cluster" {
10:03:37.956 STDOUT terraform:       + certificates = (known after apply)
10:03:37.956 STDOUT terraform:       + id           = (known after apply)
10:03:37.956 STDOUT terraform:       + url          = (known after apply)
10:03:37.956 STDOUT terraform:     }
10:03:37.956 STDOUT terraform:   # module.eks_mgmt.aws_eks_cluster.main will be created
10:03:37.956 STDOUT terraform:   + resource "aws_eks_cluster" "main" {
10:03:37.956 STDOUT terraform:       + arn                           = (known after apply)
10:03:37.956 STDOUT terraform:       + bootstrap_self_managed_addons = true
10:03:37.956 STDOUT terraform:       + certificate_authority         = (known after apply)
10:03:37.956 STDOUT terraform:       + cluster_id                    = (known after apply)
10:03:37.957 STDOUT terraform:       + created_at                    = (known after apply)
10:03:37.957 STDOUT terraform:       + deletion_protection           = (known after apply)
10:03:37.957 STDOUT terraform:       + endpoint                      = (known after apply)
10:03:37.957 STDOUT terraform:       + id                            = (known after apply)
10:03:37.957 STDOUT terraform:       + identity                      = (known after apply)
10:03:37.957 STDOUT terraform:       + name                          = "dev-mgmt-cluster"
10:03:37.957 STDOUT terraform:       + platform_version              = (known after apply)
10:03:37.957 STDOUT terraform:       + region                        = "eu-west-1"
10:03:37.957 STDOUT terraform:       + role_arn                      = (known after apply)
10:03:37.957 STDOUT terraform:       + status                        = (known after apply)
10:03:37.957 STDOUT terraform:       + tags                          = {
10:03:37.957 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.957 STDOUT terraform:           + "Environment" = "dev"
10:03:37.957 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.957 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.957 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.957 STDOUT terraform:         }
10:03:37.957 STDOUT terraform:       + tags_all                      = {
10:03:37.957 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.957 STDOUT terraform:           + "Environment" = "dev"
10:03:37.957 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.957 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.957 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.957 STDOUT terraform:         }
10:03:37.957 STDOUT terraform:       + version                       = "1.34"
10:03:37.957 STDOUT terraform:       + access_config (known after apply)
10:03:37.957 STDOUT terraform:       + compute_config (known after apply)
10:03:37.957 STDOUT terraform:       + control_plane_scaling_config (known after apply)
10:03:37.957 STDOUT terraform:       + kubernetes_network_config (known after apply)
10:03:37.957 STDOUT terraform:       + storage_config (known after apply)
10:03:37.957 STDOUT terraform:       + upgrade_policy (known after apply)
10:03:37.957 STDOUT terraform:       + vpc_config {
10:03:37.957 STDOUT terraform:           + cluster_security_group_id = (known after apply)
10:03:37.957 STDOUT terraform:           + endpoint_private_access   = true
10:03:37.957 STDOUT terraform:           + endpoint_public_access    = true
10:03:37.957 STDOUT terraform:           + public_access_cidrs       = (known after apply)
10:03:37.957 STDOUT terraform:           + security_group_ids        = (known after apply)
10:03:37.957 STDOUT terraform:           + subnet_ids                = (known after apply)
10:03:37.957 STDOUT terraform:           + vpc_id                    = (known after apply)
10:03:37.957 STDOUT terraform:         }
10:03:37.957 STDOUT terraform:     }
10:03:37.957 STDOUT terraform:   # module.eks_mgmt.aws_eks_fargate_profile.app_namespaces["argocd"] will be created
10:03:37.958 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
10:03:37.958 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.958 STDOUT terraform:       + cluster_name           = "dev-mgmt-cluster"
10:03:37.958 STDOUT terraform:       + fargate_profile_name   = "dev-mgmt-cluster-argocd"
10:03:37.958 STDOUT terraform:       + id                     = (known after apply)
10:03:37.958 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.958 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.958 STDOUT terraform:       + status                 = (known after apply)
10:03:37.958 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.958 STDOUT terraform:       + tags                   = {
10:03:37.958 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.958 STDOUT terraform:           + "Environment" = "dev"
10:03:37.958 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.958 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.958 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.958 STDOUT terraform:         }
10:03:37.958 STDOUT terraform:       + tags_all               = {
10:03:37.958 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.958 STDOUT terraform:           + "Environment" = "dev"
10:03:37.958 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.958 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.958 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.958 STDOUT terraform:         }
10:03:37.958 STDOUT terraform:       + selector {
10:03:37.958 STDOUT terraform:           + namespace = "argocd"
10:03:37.958 STDOUT terraform:         }
10:03:37.958 STDOUT terraform:     }
10:03:37.958 STDOUT terraform:   # module.eks_mgmt.aws_eks_fargate_profile.app_namespaces["default"] will be created
10:03:37.958 STDOUT terraform:   + resource "aws_eks_fargate_profile" "app_namespaces" {
10:03:37.958 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.958 STDOUT terraform:       + cluster_name           = "dev-mgmt-cluster"
10:03:37.958 STDOUT terraform:       + fargate_profile_name   = "dev-mgmt-cluster-default"
10:03:37.958 STDOUT terraform:       + id                     = (known after apply)
10:03:37.958 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.958 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.958 STDOUT terraform:       + status                 = (known after apply)
10:03:37.958 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.958 STDOUT terraform:       + tags                   = {
10:03:37.958 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.958 STDOUT terraform:           + "Environment" = "dev"
10:03:37.959 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.959 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.959 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.959 STDOUT terraform:         }
10:03:37.959 STDOUT terraform:       + tags_all               = {
10:03:37.959 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.959 STDOUT terraform:           + "Environment" = "dev"
10:03:37.959 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.959 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.959 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.959 STDOUT terraform:         }
10:03:37.959 STDOUT terraform:       + selector {
10:03:37.959 STDOUT terraform:           + namespace = "default"
10:03:37.959 STDOUT terraform:         }
10:03:37.959 STDOUT terraform:     }
10:03:37.959 STDOUT terraform:   # module.eks_mgmt.aws_eks_fargate_profile.kube_system will be created
10:03:37.959 STDOUT terraform:   + resource "aws_eks_fargate_profile" "kube_system" {
10:03:37.959 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.959 STDOUT terraform:       + cluster_name           = "dev-mgmt-cluster"
10:03:37.959 STDOUT terraform:       + fargate_profile_name   = "dev-mgmt-cluster-kube-system"
10:03:37.959 STDOUT terraform:       + id                     = (known after apply)
10:03:37.959 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
10:03:37.959 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.959 STDOUT terraform:       + status                 = (known after apply)
10:03:37.959 STDOUT terraform:       + subnet_ids             = (known after apply)
10:03:37.959 STDOUT terraform:       + tags                   = {
10:03:37.959 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.959 STDOUT terraform:           + "Environment" = "dev"
10:03:37.959 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.959 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.959 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.959 STDOUT terraform:         }
10:03:37.959 STDOUT terraform:       + tags_all               = {
10:03:37.959 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.959 STDOUT terraform:           + "Environment" = "dev"
10:03:37.959 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.959 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.959 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.959 STDOUT terraform:         }
10:03:37.959 STDOUT terraform:       + selector {
10:03:37.959 STDOUT terraform:           + namespace = "kube-system"
10:03:37.959 STDOUT terraform:         }
10:03:37.959 STDOUT terraform:     }
10:03:37.959 STDOUT terraform:   # module.eks_mgmt.aws_iam_openid_connect_provider.cluster will be created
10:03:37.959 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "cluster" {
10:03:37.959 STDOUT terraform:       + arn             = (known after apply)
10:03:37.960 STDOUT terraform:       + client_id_list  = [
10:03:37.960 STDOUT terraform:           + "sts.amazonaws.com",
10:03:37.960 STDOUT terraform:         ]
10:03:37.960 STDOUT terraform:       + id              = (known after apply)
10:03:37.960 STDOUT terraform:       + tags            = {
10:03:37.960 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.960 STDOUT terraform:           + "Environment" = "dev"
10:03:37.960 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.960 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.960 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.960 STDOUT terraform:         }
10:03:37.960 STDOUT terraform:       + tags_all        = {
10:03:37.960 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.960 STDOUT terraform:           + "Environment" = "dev"
10:03:37.960 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.960 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.960 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.960 STDOUT terraform:         }
10:03:37.960 STDOUT terraform:       + thumbprint_list = (known after apply)
10:03:37.960 STDOUT terraform:       + url             = (known after apply)
10:03:37.960 STDOUT terraform:     }
10:03:37.960 STDOUT terraform:   # module.eks_mgmt.aws_iam_policy.aws_load_balancer_controller[0] will be created
10:03:37.960 STDOUT terraform:   + resource "aws_iam_policy" "aws_load_balancer_controller" {
10:03:37.960 STDOUT terraform:       + arn              = (known after apply)
10:03:37.960 STDOUT terraform:       + attachment_count = (known after apply)
10:03:37.960 STDOUT terraform:       + description      = "IAM policy for AWS Load Balancer Controller"
10:03:37.960 STDOUT terraform:       + id               = (known after apply)
10:03:37.960 STDOUT terraform:       + name             = "dev-mgmt-cluster-aws-lb-controller-policy"
10:03:37.960 STDOUT terraform:       + name_prefix      = (known after apply)
10:03:37.960 STDOUT terraform:       + path             = "/"
10:03:37.960 STDOUT terraform:       + policy           = jsonencode(
10:03:37.960 STDOUT terraform:             {
10:03:37.960 STDOUT terraform:               + Statement = [
10:03:37.960 STDOUT terraform:                   + {
10:03:37.960 STDOUT terraform:                       + Action    = [
10:03:37.960 STDOUT terraform:                           + "iam:CreateServiceLinkedRole",
10:03:37.960 STDOUT terraform:                         ]
10:03:37.960 STDOUT terraform:                       + Condition = {
10:03:37.960 STDOUT terraform:                           + StringEquals = {
10:03:37.960 STDOUT terraform:                               + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
10:03:37.960 STDOUT terraform:                             }
10:03:37.960 STDOUT terraform:                         }
10:03:37.960 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.960 STDOUT terraform:                       + Resource  = "*"
10:03:37.960 STDOUT terraform:                     },
10:03:37.960 STDOUT terraform:                   + {
10:03:37.960 STDOUT terraform:                       + Action   = [
10:03:37.960 STDOUT terraform:                           + "ec2:DescribeAccountAttributes",
10:03:37.960 STDOUT terraform:                           + "ec2:DescribeAddresses",
10:03:37.960 STDOUT terraform:                           + "ec2:DescribeAvailabilityZones",
10:03:37.960 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
10:03:37.960 STDOUT terraform:                           + "ec2:DescribeVpcs",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeSubnets",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeInstances",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeTags",
10:03:37.961 STDOUT terraform:                           + "ec2:GetCoipPoolUsage",
10:03:37.961 STDOUT terraform:                           + "ec2:DescribeCoipPools",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancers",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeLoadBalancerAttributes",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeListeners",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeListenerCertificates",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeSSLPolicies",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeRules",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroups",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetGroupAttributes",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeTargetHealth",
10:03:37.961 STDOUT terraform:                           + "elasticloadbalancing:DescribeTags",
10:03:37.961 STDOUT terraform:                         ]
10:03:37.961 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.961 STDOUT terraform:                       + Resource = "*"
10:03:37.961 STDOUT terraform:                     },
10:03:37.961 STDOUT terraform:                   + {
10:03:37.961 STDOUT terraform:                       + Action   = [
10:03:37.961 STDOUT terraform:                           + "cognito-idp:DescribeUserPoolClient",
10:03:37.961 STDOUT terraform:                           + "acm:ListCertificates",
10:03:37.961 STDOUT terraform:                           + "acm:DescribeCertificate",
10:03:37.961 STDOUT terraform:                           + "iam:ListServerCertificates",
10:03:37.961 STDOUT terraform:                           + "iam:GetServerCertificate",
10:03:37.961 STDOUT terraform:                           + "waf-regional:GetWebACL",
10:03:37.961 STDOUT terraform:                           + "waf-regional:GetWebACLForResource",
10:03:37.961 STDOUT terraform:                           + "waf-regional:AssociateWebACL",
10:03:37.961 STDOUT terraform:                           + "waf-regional:DisassociateWebACL",
10:03:37.961 STDOUT terraform:                           + "wafv2:GetWebACL",
10:03:37.961 STDOUT terraform:                           + "wafv2:GetWebACLForResource",
10:03:37.961 STDOUT terraform:                           + "wafv2:AssociateWebACL",
10:03:37.961 STDOUT terraform:                           + "wafv2:DisassociateWebACL",
10:03:37.961 STDOUT terraform:                           + "shield:GetSubscriptionState",
10:03:37.961 STDOUT terraform:                           + "shield:DescribeProtection",
10:03:37.961 STDOUT terraform:                           + "shield:CreateProtection",
10:03:37.961 STDOUT terraform:                           + "shield:DeleteProtection",
10:03:37.961 STDOUT terraform:                         ]
10:03:37.961 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.961 STDOUT terraform:                       + Resource = "*"
10:03:37.961 STDOUT terraform:                     },
10:03:37.961 STDOUT terraform:                   + {
10:03:37.961 STDOUT terraform:                       + Action   = [
10:03:37.961 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
10:03:37.961 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
10:03:37.961 STDOUT terraform:                         ]
10:03:37.961 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.961 STDOUT terraform:                       + Resource = "*"
10:03:37.961 STDOUT terraform:                     },
10:03:37.961 STDOUT terraform:                   + {
10:03:37.961 STDOUT terraform:                       + Action   = [
10:03:37.961 STDOUT terraform:                           + "ec2:CreateSecurityGroup",
10:03:37.961 STDOUT terraform:                         ]
10:03:37.961 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.961 STDOUT terraform:                       + Resource = "*"
10:03:37.961 STDOUT terraform:                     },
10:03:37.961 STDOUT terraform:                   + {
10:03:37.961 STDOUT terraform:                       + Action    = [
10:03:37.961 STDOUT terraform:                           + "ec2:CreateTags",
10:03:37.962 STDOUT terraform:                         ]
10:03:37.962 STDOUT terraform:                       + Condition = {
10:03:37.962 STDOUT terraform:                           + Null         = {
10:03:37.962 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.962 STDOUT terraform:                             }
10:03:37.962 STDOUT terraform:                           + StringEquals = {
10:03:37.962 STDOUT terraform:                               + "ec2:CreateAction" = "CreateSecurityGroup"
10:03:37.962 STDOUT terraform:                             }
10:03:37.962 STDOUT terraform:                         }
10:03:37.962 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.962 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
10:03:37.962 STDOUT terraform:                     },
10:03:37.962 STDOUT terraform:                   + {
10:03:37.962 STDOUT terraform:                       + Action    = [
10:03:37.962 STDOUT terraform:                           + "ec2:CreateTags",
10:03:37.962 STDOUT terraform:                           + "ec2:DeleteTags",
10:03:37.962 STDOUT terraform:                         ]
10:03:37.962 STDOUT terraform:                       + Condition = {
10:03:37.962 STDOUT terraform:                           + Null = {
10:03:37.962 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
10:03:37.962 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.962 STDOUT terraform:                             }
10:03:37.962 STDOUT terraform:                         }
10:03:37.962 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.962 STDOUT terraform:                       + Resource  = "arn:aws:ec2:*:*:security-group/*"
10:03:37.962 STDOUT terraform:                     },
10:03:37.962 STDOUT terraform:                   + {
10:03:37.962 STDOUT terraform:                       + Action    = [
10:03:37.962 STDOUT terraform:                           + "ec2:AuthorizeSecurityGroupIngress",
10:03:37.962 STDOUT terraform:                           + "ec2:RevokeSecurityGroupIngress",
10:03:37.962 STDOUT terraform:                           + "ec2:DeleteSecurityGroup",
10:03:37.962 STDOUT terraform:                         ]
10:03:37.962 STDOUT terraform:                       + Condition = {
10:03:37.962 STDOUT terraform:                           + Null = {
10:03:37.962 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.962 STDOUT terraform:                             }
10:03:37.962 STDOUT terraform:                         }
10:03:37.962 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.962 STDOUT terraform:                       + Resource  = "*"
10:03:37.962 STDOUT terraform:                     },
10:03:37.962 STDOUT terraform:                   + {
10:03:37.962 STDOUT terraform:                       + Action    = [
10:03:37.962 STDOUT terraform:                           + "elasticloadbalancing:CreateLoadBalancer",
10:03:37.962 STDOUT terraform:                           + "elasticloadbalancing:CreateTargetGroup",
10:03:37.962 STDOUT terraform:                         ]
10:03:37.962 STDOUT terraform:                       + Condition = {
10:03:37.962 STDOUT terraform:                           + Null = {
10:03:37.962 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.962 STDOUT terraform:                             }
10:03:37.962 STDOUT terraform:                         }
10:03:37.962 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.962 STDOUT terraform:                       + Resource  = "*"
10:03:37.962 STDOUT terraform:                     },
10:03:37.962 STDOUT terraform:                   + {
10:03:37.962 STDOUT terraform:                       + Action   = [
10:03:37.962 STDOUT terraform:                           + "elasticloadbalancing:CreateListener",
10:03:37.962 STDOUT terraform:                           + "elasticloadbalancing:DeleteListener",
10:03:37.962 STDOUT terraform:                           + "elasticloadbalancing:CreateRule",
10:03:37.962 STDOUT terraform:                           + "elasticloadbalancing:DeleteRule",
10:03:37.962 STDOUT terraform:                         ]
10:03:37.962 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.962 STDOUT terraform:                       + Resource = "*"
10:03:37.962 STDOUT terraform:                     },
10:03:37.962 STDOUT terraform:                   + {
10:03:37.962 STDOUT terraform:                       + Action    = [
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
10:03:37.963 STDOUT terraform:                         ]
10:03:37.963 STDOUT terraform:                       + Condition = {
10:03:37.963 STDOUT terraform:                           + Null = {
10:03:37.963 STDOUT terraform:                               + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
10:03:37.963 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.963 STDOUT terraform:                             }
10:03:37.963 STDOUT terraform:                         }
10:03:37.963 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.963 STDOUT terraform:                       + Resource  = [
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
10:03:37.963 STDOUT terraform:                         ]
10:03:37.963 STDOUT terraform:                     },
10:03:37.963 STDOUT terraform:                   + {
10:03:37.963 STDOUT terraform:                       + Action   = [
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:AddTags",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:RemoveTags",
10:03:37.963 STDOUT terraform:                         ]
10:03:37.963 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.963 STDOUT terraform:                       + Resource = [
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
10:03:37.963 STDOUT terraform:                           + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
10:03:37.963 STDOUT terraform:                         ]
10:03:37.963 STDOUT terraform:                     },
10:03:37.963 STDOUT terraform:                   + {
10:03:37.963 STDOUT terraform:                       + Action    = [
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:ModifyLoadBalancerAttributes",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:SetIpAddressType",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:SetSecurityGroups",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:SetSubnets",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:DeleteLoadBalancer",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroup",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:ModifyTargetGroupAttributes",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:DeleteTargetGroup",
10:03:37.963 STDOUT terraform:                         ]
10:03:37.963 STDOUT terraform:                       + Condition = {
10:03:37.963 STDOUT terraform:                           + Null = {
10:03:37.963 STDOUT terraform:                               + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
10:03:37.963 STDOUT terraform:                             }
10:03:37.963 STDOUT terraform:                         }
10:03:37.963 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.963 STDOUT terraform:                       + Resource  = "*"
10:03:37.963 STDOUT terraform:                     },
10:03:37.963 STDOUT terraform:                   + {
10:03:37.963 STDOUT terraform:                       + Action   = [
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:RegisterTargets",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:DeregisterTargets",
10:03:37.963 STDOUT terraform:                         ]
10:03:37.963 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.963 STDOUT terraform:                       + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
10:03:37.963 STDOUT terraform:                     },
10:03:37.963 STDOUT terraform:                   + {
10:03:37.963 STDOUT terraform:                       + Action   = [
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:SetWebAcl",
10:03:37.963 STDOUT terraform:                           + "elasticloadbalancing:ModifyListener",
10:03:37.964 STDOUT terraform:                           + "elasticloadbalancing:AddListenerCertificates",
10:03:37.964 STDOUT terraform:                           + "elasticloadbalancing:RemoveListenerCertificates",
10:03:37.964 STDOUT terraform:                           + "elasticloadbalancing:ModifyRule",
10:03:37.964 STDOUT terraform:                         ]
10:03:37.964 STDOUT terraform:                       + Effect   = "Allow"
10:03:37.964 STDOUT terraform:                       + Resource = "*"
10:03:37.964 STDOUT terraform:                     },
10:03:37.964 STDOUT terraform:                 ]
10:03:37.964 STDOUT terraform:               + Version   = "2012-10-17"
10:03:37.964 STDOUT terraform:             }
10:03:37.964 STDOUT terraform:         )
10:03:37.964 STDOUT terraform:       + policy_id        = (known after apply)
10:03:37.964 STDOUT terraform:       + tags             = {
10:03:37.964 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.964 STDOUT terraform:           + "Environment" = "dev"
10:03:37.964 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.964 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.964 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.964 STDOUT terraform:         }
10:03:37.964 STDOUT terraform:       + tags_all         = {
10:03:37.964 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.964 STDOUT terraform:           + "Environment" = "dev"
10:03:37.964 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.964 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.964 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.964 STDOUT terraform:         }
10:03:37.964 STDOUT terraform:     }
10:03:37.964 STDOUT terraform:   # module.eks_mgmt.aws_iam_role.aws_load_balancer_controller[0] will be created
10:03:37.964 STDOUT terraform:   + resource "aws_iam_role" "aws_load_balancer_controller" {
10:03:37.964 STDOUT terraform:       + arn                   = (known after apply)
10:03:37.964 STDOUT terraform:       + assume_role_policy    = (known after apply)
10:03:37.964 STDOUT terraform:       + create_date           = (known after apply)
10:03:37.964 STDOUT terraform:       + force_detach_policies = false
10:03:37.964 STDOUT terraform:       + id                    = (known after apply)
10:03:37.964 STDOUT terraform:       + managed_policy_arns   = (known after apply)
10:03:37.964 STDOUT terraform:       + max_session_duration  = 3600
10:03:37.964 STDOUT terraform:       + name                  = "dev-mgmt-cluster-aws-lb-controller"
10:03:37.964 STDOUT terraform:       + name_prefix           = (known after apply)
10:03:37.964 STDOUT terraform:       + path                  = "/"
10:03:37.964 STDOUT terraform:       + tags                  = {
10:03:37.964 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.964 STDOUT terraform:           + "Environment" = "dev"
10:03:37.964 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.964 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.964 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.964 STDOUT terraform:         }
10:03:37.964 STDOUT terraform:       + tags_all              = {
10:03:37.964 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.964 STDOUT terraform:           + "Environment" = "dev"
10:03:37.964 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.964 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.964 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.964 STDOUT terraform:         }
10:03:37.964 STDOUT terraform:       + unique_id             = (known after apply)
10:03:37.964 STDOUT terraform:       + inline_policy (known after apply)
10:03:37.964 STDOUT terraform:     }
10:03:37.964 STDOUT terraform:   # module.eks_mgmt.aws_iam_role.cluster will be created
10:03:37.964 STDOUT terraform:   + resource "aws_iam_role" "cluster" {
10:03:37.964 STDOUT terraform:       + arn                   = (known after apply)
10:03:37.964 STDOUT terraform:       + assume_role_policy    = jsonencode(
10:03:37.964 STDOUT terraform:             {
10:03:37.964 STDOUT terraform:               + Statement = [
10:03:37.964 STDOUT terraform:                   + {
10:03:37.964 STDOUT terraform:                       + Action    = "sts:AssumeRole"
10:03:37.964 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.964 STDOUT terraform:                       + Principal = {
10:03:37.964 STDOUT terraform:                           + Service = "eks.amazonaws.com"
10:03:37.964 STDOUT terraform:                         }
10:03:37.964 STDOUT terraform:                     },
10:03:37.964 STDOUT terraform:                 ]
10:03:37.964 STDOUT terraform:               + Version   = "2012-10-17"
10:03:37.964 STDOUT terraform:             }
10:03:37.965 STDOUT terraform:         )
10:03:37.965 STDOUT terraform:       + create_date           = (known after apply)
10:03:37.965 STDOUT terraform:       + force_detach_policies = false
10:03:37.965 STDOUT terraform:       + id                    = (known after apply)
10:03:37.965 STDOUT terraform:       + managed_policy_arns   = (known after apply)
10:03:37.965 STDOUT terraform:       + max_session_duration  = 3600
10:03:37.965 STDOUT terraform:       + name                  = "dev-mgmt-cluster-cluster-role"
10:03:37.965 STDOUT terraform:       + name_prefix           = (known after apply)
10:03:37.965 STDOUT terraform:       + path                  = "/"
10:03:37.965 STDOUT terraform:       + tags                  = {
10:03:37.965 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.965 STDOUT terraform:           + "Environment" = "dev"
10:03:37.965 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.965 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.965 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.965 STDOUT terraform:         }
10:03:37.965 STDOUT terraform:       + tags_all              = {
10:03:37.965 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.965 STDOUT terraform:           + "Environment" = "dev"
10:03:37.965 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.965 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.965 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.965 STDOUT terraform:         }
10:03:37.965 STDOUT terraform:       + unique_id             = (known after apply)
10:03:37.965 STDOUT terraform:       + inline_policy (known after apply)
10:03:37.965 STDOUT terraform:     }
10:03:37.965 STDOUT terraform:   # module.eks_mgmt.aws_iam_role.fargate will be created
10:03:37.965 STDOUT terraform:   + resource "aws_iam_role" "fargate" {
10:03:37.965 STDOUT terraform:       + arn                   = (known after apply)
10:03:37.965 STDOUT terraform:       + assume_role_policy    = jsonencode(
10:03:37.965 STDOUT terraform:             {
10:03:37.965 STDOUT terraform:               + Statement = [
10:03:37.965 STDOUT terraform:                   + {
10:03:37.965 STDOUT terraform:                       + Action    = "sts:AssumeRole"
10:03:37.965 STDOUT terraform:                       + Effect    = "Allow"
10:03:37.965 STDOUT terraform:                       + Principal = {
10:03:37.965 STDOUT terraform:                           + Service = "eks-fargate-pods.amazonaws.com"
10:03:37.965 STDOUT terraform:                         }
10:03:37.965 STDOUT terraform:                     },
10:03:37.965 STDOUT terraform:                 ]
10:03:37.965 STDOUT terraform:               + Version   = "2012-10-17"
10:03:37.965 STDOUT terraform:             }
10:03:37.965 STDOUT terraform:         )
10:03:37.965 STDOUT terraform:       + create_date           = (known after apply)
10:03:37.965 STDOUT terraform:       + force_detach_policies = false
10:03:37.965 STDOUT terraform:       + id                    = (known after apply)
10:03:37.965 STDOUT terraform:       + managed_policy_arns   = (known after apply)
10:03:37.965 STDOUT terraform:       + max_session_duration  = 3600
10:03:37.965 STDOUT terraform:       + name                  = "dev-mgmt-cluster-fargate-role"
10:03:37.965 STDOUT terraform:       + name_prefix           = (known after apply)
10:03:37.965 STDOUT terraform:       + path                  = "/"
10:03:37.965 STDOUT terraform:       + tags                  = {
10:03:37.965 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.965 STDOUT terraform:           + "Environment" = "dev"
10:03:37.965 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.965 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.965 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.965 STDOUT terraform:         }
10:03:37.965 STDOUT terraform:       + tags_all              = {
10:03:37.965 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.965 STDOUT terraform:           + "Environment" = "dev"
10:03:37.965 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.965 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.965 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.965 STDOUT terraform:         }
10:03:37.965 STDOUT terraform:       + unique_id             = (known after apply)
10:03:37.965 STDOUT terraform:       + inline_policy (known after apply)
10:03:37.965 STDOUT terraform:     }
10:03:37.965 STDOUT terraform:   # module.eks_mgmt.aws_iam_role_policy_attachment.aws_load_balancer_controller[0] will be created
10:03:37.965 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller" {
10:03:37.965 STDOUT terraform:       + id         = (known after apply)
10:03:37.965 STDOUT terraform:       + policy_arn = (known after apply)
10:03:37.965 STDOUT terraform:       + role       = "dev-mgmt-cluster-aws-lb-controller"
10:03:37.965 STDOUT terraform:     }
10:03:37.965 STDOUT terraform:   # module.eks_mgmt.aws_iam_role_policy_attachment.cluster_policy will be created
10:03:37.966 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_policy" {
10:03:37.966 STDOUT terraform:       + id         = (known after apply)
10:03:37.966 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
10:03:37.966 STDOUT terraform:       + role       = "dev-mgmt-cluster-cluster-role"
10:03:37.966 STDOUT terraform:     }
10:03:37.966 STDOUT terraform:   # module.eks_mgmt.aws_iam_role_policy_attachment.fargate_pod_execution will be created
10:03:37.966 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "fargate_pod_execution" {
10:03:37.966 STDOUT terraform:       + id         = (known after apply)
10:03:37.966 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
10:03:37.966 STDOUT terraform:       + role       = "dev-mgmt-cluster-fargate-role"
10:03:37.966 STDOUT terraform:     }
10:03:37.966 STDOUT terraform:   # module.eks_mgmt.aws_security_group.cluster will be created
10:03:37.966 STDOUT terraform:   + resource "aws_security_group" "cluster" {
10:03:37.966 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.966 STDOUT terraform:       + description            = "Security group for EKS cluster control plane"
10:03:37.966 STDOUT terraform:       + egress                 = [
10:03:37.966 STDOUT terraform:           + {
10:03:37.966 STDOUT terraform:               + cidr_blocks      = [
10:03:37.966 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.966 STDOUT terraform:                 ]
10:03:37.966 STDOUT terraform:               + description      = "Allow all outbound traffic"
10:03:37.966 STDOUT terraform:               + from_port        = 0
10:03:37.966 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.966 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.966 STDOUT terraform:               + protocol         = "-1"
10:03:37.966 STDOUT terraform:               + security_groups  = []
10:03:37.966 STDOUT terraform:         
10:03:37.966 STDOUT terraform:       + self             = false
10:03:37.966 STDOUT terraform:               + to_port          = 0
10:03:37.966 STDOUT terraform:             },
10:03:37.966 STDOUT terraform:         ]
10:03:37.966 STDOUT terraform:       + id                     = (known after apply)
10:03:37.966 STDOUT terraform:       + ingress                = (known after apply)
10:03:37.966 STDOUT terraform:       + name                   = "dev-mgmt-cluster-cluster-sg"
10:03:37.966 STDOUT terraform:       + name_prefix            = (known after apply)
10:03:37.966 STDOUT terraform:       + owner_id               = (known after apply)
10:03:37.966 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.966 STDOUT terraform:       + revoke_rules_on_delete = false
10:03:37.966 STDOUT terraform:       + tags                   = {
10:03:37.966 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.966 STDOUT terraform:           + "Environment" = "dev"
10:03:37.966 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.966 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-cluster-sg"
10:03:37.966 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.966 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.966 STDOUT terraform:         }
10:03:37.966 STDOUT terraform:       + tags_all               = {
10:03:37.966 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.966 STDOUT terraform:           + "Environment" = "dev"
10:03:37.966 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.966 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-cluster-sg"
10:03:37.966 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.966 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.966 STDOUT terraform:         }
10:03:37.966 STDOUT terraform:       + vpc_id                 = (known after apply)
10:03:37.966 STDOUT terraform:     }
10:03:37.966 STDOUT terraform:   # module.eks_mgmt.aws_security_group.pods will be created
10:03:37.966 STDOUT terraform:   + resource "aws_security_group" "pods" {
10:03:37.966 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.966 STDOUT terraform:       + description            = "Security group for Fargate pods"
10:03:37.966 STDOUT terraform:       + egress                 = [
10:03:37.966 STDOUT terraform:           + {
10:03:37.966 STDOUT terraform:               + cidr_blocks      = [
10:03:37.966 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.966 STDOUT terraform:                 ]
10:03:37.966 STDOUT terraform:               + description      = "Allow all outbound traffic"
10:03:37.966 STDOUT terraform:               + from_port        = 0
10:03:37.967 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.967 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.967 STDOUT terraform:               + protocol         = "-1"
10:03:37.967 STDOUT terraform:               + security_groups  = []
10:03:37.967 STDOUT terraform:               + self             = false
10:03:37.967 STDOUT terraform:               + to_port          = 0
10:03:37.967 STDOUT terraform:             },
10:03:37.967 STDOUT terraform:         ]
10:03:37.967 STDOUT terraform:       + id                     = (known after apply)
10:03:37.967 STDOUT terraform:       + ingress                = (known after apply)
10:03:37.967 STDOUT terraform:       + name                   = "dev-mgmt-cluster-pods-sg"
10:03:37.967 STDOUT terraform:       + name_prefix            = (known after apply)
10:03:37.967 STDOUT terraform:       + owner_id               = (known after apply)
10:03:37.967 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.967 STDOUT terraform:       + revoke_rules_on_delete = false
10:03:37.967 STDOUT terraform:       + tags                   = {
10:03:37.967 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.967 STDOUT terraform:           + "Environment" = "dev"
10:03:37.967 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.967 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-pods-sg"
10:03:37.967 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.967 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.967 STDOUT terraform:         }
10:03:37.967 STDOUT terraform:       + tags_all               = {
10:03:37.967 STDOUT terraform:           + "Cluster"     = "mgmt-cluster"
10:03:37.967 STDOUT terraform:           + "Environment" = "dev"
10:03:37.967 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.967 STDOUT terraform:           + "Name"        = "dev-mgmt-cluster-pods-sg"
10:03:37.967 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.967 STDOUT terraform:           + "Purpose"     = "argocd-management"
10:03:37.967 STDOUT terraform:         }
10:03:37.967 STDOUT terraform:       + vpc_id                 = (known after apply)
10:03:37.967 STDOUT terraform:     }
10:03:37.967 STDOUT terraform:   # module.eks_mgmt.aws_security_group_rule.alb_to_pods["enabled"] will be created
10:03:37.967 STDOUT terraform:   + resource "aws_security_group_rule" "alb_to_pods" {
10:03:37.967 STDOUT terraform:       + description              = "Allow traffic from ALB"
10:03:37.967 STDOUT terraform:       + from_port                = 0
10:03:37.967 STDOUT terraform:       + id                       = (known after apply)
10:03:37.967 STDOUT terraform:       + protocol                 = "tcp"
10:03:37.967 STDOUT terraform:       + region                   = "eu-west-1"
10:03:37.967 STDOUT terraform:       + security_group_id        = (known after apply)
10:03:37.967 STDOUT terraform:       + security_group_rule_id   = (known after apply)
10:03:37.967 STDOUT terraform:       + self                     = false
10:03:37.967 STDOUT terraform:       + source_security_group_id = (known after apply)
10:03:37.967 STDOUT terraform:       + to_port                  = 65535
10:03:37.967 STDOUT terraform:       + type                     = "ingress"
10:03:37.967 STDOUT terraform:     }
10:03:37.967 STDOUT terraform:   # module.vpc.aws_eip.nat will be created
10:03:37.967 STDOUT terraform:   + resource "aws_eip" "nat" {
10:03:37.967 STDOUT terraform:       + allocation_id        = (known after apply)
10:03:37.967 STDOUT terraform:       + arn                  = (known after apply)
10:03:37.967 STDOUT terraform:       + association_id       = (known after apply)
10:03:37.967 STDOUT terraform:       + carrier_ip           = (known after apply)
10:03:37.967 STDOUT terraform:       + customer_owned_ip    = (known after apply)
10:03:37.967 STDOUT terraform:       + domain               = "vpc"
10:03:37.967 STDOUT terraform:       + id                   = (known after apply)
10:03:37.967 STDOUT terraform:       + instance             = (known after apply)
10:03:37.967 STDOUT terraform:       + ipam_pool_id         = (known after apply)
10:03:37.967 STDOUT terraform:       + network_border_group = (known after apply)
10:03:37.967 STDOUT terraform:       + network_interface    = (known after apply)
10:03:37.967 STDOUT terraform:       + private_dns          = (known after apply)
10:03:37.967 STDOUT terraform:       + private_ip           = (known after apply)
10:03:37.967 STDOUT terraform:       + ptr_record           = (known after apply)
10:03:37.967 STDOUT terraform:       + public_dns           = (known after apply)
10:03:37.967 STDOUT terraform:       + public_ip            = (known after apply)
10:03:37.967 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
10:03:37.967 STDOUT terraform:       + region               = "eu-west-1"
10:03:37.967 STDOUT terraform:       + tags                 = {
10:03:37.967 STDOUT terraform:           + "Environment" = "dev"
10:03:37.967 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.967 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat-eip"
10:03:37.967 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.968 STDOUT terraform:         }
10:03:37.968 STDOUT terraform:       + tags_all             = {
10:03:37.968 STDOUT terraform:           + "Environment" = "dev"
10:03:37.968 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.968 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat-eip"
10:03:37.968 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.968 STDOUT terraform:         }
10:03:37.968 STDOUT terraform:     }
10:03:37.968 STDOUT terraform:   # module.vpc.aws_internet_gateway.main will be created
10:03:37.968 STDOUT terraform:   + resource "aws_internet_gateway" "main" {
10:03:37.968 STDOUT terraform:       + arn      = (known after apply)
10:03:37.968 STDOUT terraform:       + id       = (known after apply)
10:03:37.968 STDOUT terraform:       + owner_id = (known after apply)
10:03:37.968 STDOUT terraform:       + region   = "eu-west-1"
10:03:37.968 STDOUT terraform:       + tags     = {
10:03:37.968 STDOUT terraform:           + "Environment" = "dev"
10:03:37.968 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.968 STDOUT terraform:           + "Name"        = "dev-shared-vpc-igw"
10:03:37.968 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.968 STDOUT terraform:         }
10:03:37.968 STDOUT terraform:       + tags_all = {
10:03:37.968 STDOUT terraform:           + "Environment" = "dev"
10:03:37.968 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.968 STDOUT terraform:           + "Name"        = "dev-shared-vpc-igw"
10:03:37.968 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.968 STDOUT terraform:         }
10:03:37.968 STDOUT terraform:       + vpc_id   = (known after apply)
10:03:37.968 STDOUT terraform:     }
10:03:37.968 STDOUT terraform:   # module.vpc.aws_lb.shared[0] will be created
10:03:37.968 STDOUT terraform:   + resource "aws_lb" "shared" {
10:03:37.968 STDOUT terraform:       + arn                                                          = (known after apply)
10:03:37.968 STDOUT terraform:       + arn_suffix                                                   = (known after apply)
10:03:37.968 STDOUT terraform:       + client_keep_alive                                            = 3600
10:03:37.968 STDOUT terraform:       + desync_mitigation_mode                                       = "defensive"
10:03:37.968 STDOUT terraform:       + dns_name                                                     = (known after apply)
10:03:37.968 STDOUT terraform:       + drop_invalid_header_fields                                   = false
10:03:37.968 STDOUT terraform:       + enable_deletion_protection                                   = false
10:03:37.968 STDOUT terraform:       + enable_http2                                                 = true
10:03:37.968 STDOUT terraform:       + enable_tls_version_and_cipher_suite_headers                  = false
10:03:37.968 STDOUT terraform:       + enable_waf_fail_open                                         = false
10:03:37.968 STDOUT terraform:       + enable_xff_client_port                                       = false
10:03:37.968 STDOUT terraform:       + enable_zonal_shift                                           = false
10:03:37.968 STDOUT terraform:       + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
10:03:37.968 STDOUT terraform:       + id                                                           = (known after apply)
10:03:37.968 STDOUT terraform:       + idle_timeout                                                 = 60
10:03:37.968 STDOUT terraform:       + internal                                                     = false
10:03:37.968 STDOUT terraform:       + ip_address_type                                              = (known after apply)
10:03:37.968 STDOUT terraform:       + load_balancer_type                                           = "application"
10:03:37.968 STDOUT terraform:       + name                                                         = "dev-shared-vpc-shared-alb"
10:03:37.968 STDOUT terraform:       + name_prefix                                                  = (known after apply)
10:03:37.968 STDOUT terraform:       + preserve_host_header                                         = false
10:03:37.968 STDOUT terraform:       + region                                                       = "eu-west-1"
10:03:37.968 STDOUT terraform:       + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
10:03:37.968 STDOUT terraform:       + security_groups                                              = (known after apply)
10:03:37.968 STDOUT terraform:       + subnets                                                      = (known after apply)
10:03:37.968 STDOUT terraform:       + tags                                                         = {
10:03:37.969 STDOUT terraform:           + "Environment" = "dev"
10:03:37.969 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.969 STDOUT terraform:           + "Name"        = "dev-shared-vpc-shared-alb"
10:03:37.969 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.969 STDOUT terraform:         }
10:03:37.969 STDOUT terraform:       + tags_all                                                     = {
10:03:37.969 STDOUT terraform:           + "Environment" = "dev"
10:03:37.969 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.969 STDOUT terraform:           + "Name"        = "dev-shared-vpc-shared-alb"
10:03:37.969 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.969 STDOUT terraform:         }
10:03:37.969 STDOUT terraform:       + vpc_id                                                       = (known after apply)
10:03:37.969 STDOUT terraform:       + xff_header_processing_mode                                   = "append"
10:03:37.969 STDOUT terraform:       + zone_id                                                      = (known after apply)
10:03:37.969 STDOUT terraform:       + subnet_mapping (known after apply)
10:03:37.969 STDOUT terraform:     }
10:03:37.969 STDOUT terraform:   # module.vpc.aws_lb_listener.http[0] will be created
10:03:37.969 STDOUT terraform:   + resource "aws_lb_listener" "http" {
10:03:37.969 STDOUT terraform:       + arn                                                                   = (known after apply)
10:03:37.969 STDOUT terraform:       + id                                                                    = (known after apply)
10:03:37.969 STDOUT terraform:       + load_balancer_arn                                                     = (known after apply)
10:03:37.969 STDOUT terraform:       + port                                                                  = 80
10:03:37.969 STDOUT terraform:       + protocol                                                              = "HTTP"
10:03:37.969 STDOUT terraform:       + region                                                                = "eu-west-1"
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_access_control_max_age_header_value             = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_content_security_policy_header_value            = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_server_enabled                                  = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_strict_transport_security_header_value          = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_x_content_type_options_header_value             = (known after apply)
10:03:37.969 STDOUT terraform:       + routing_http_response_x_frame_options_header_value                    = (known after apply)
10:03:37.969 STDOUT terraform:       + ssl_policy                                                            = (known after apply)
10:03:37.969 STDOUT terraform:       + tags_all                                                              = (known after apply)
10:03:37.970 STDOUT terraform:       + tcp_idle_timeout_seconds                                              = (known after apply)
10:03:37.970 STDOUT terraform:       + default_action {
10:03:37.970 STDOUT terraform:           + order = (known after apply)
10:03:37.970 STDOUT terraform:           + type  = "fixed-response"
10:03:37.970 STDOUT terraform:           + fixed_response {
10:03:37.970 STDOUT terraform:               + content_type = "text/plain"
10:03:37.970 STDOUT terraform:               + message_body = "Not Found"
10:03:37.970 STDOUT terraform:               + status_code  = "404"
10:03:37.970 STDOUT terraform:             }
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + mutual_authentication (known after apply)
10:03:37.970 STDOUT terraform:     }
10:03:37.970 STDOUT terraform:   # module.vpc.aws_lb_listener_rule.clusters["apps"] will be created
10:03:37.970 STDOUT terraform:   + resource "aws_lb_listener_rule" "clusters" {
10:03:37.970 STDOUT terraform:       + arn          = (known after apply)
10:03:37.970 STDOUT terraform:       + id           = (known after apply)
10:03:37.970 STDOUT terraform:       + listener_arn = (known after apply)
10:03:37.970 STDOUT terraform:       + priority     = 200
10:03:37.970 STDOUT terraform:       + region       = "eu-west-1"
10:03:37.970 STDOUT terraform:       + tags         = {
10:03:37.970 STDOUT terraform:           + "Environment" = "dev"
10:03:37.970 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.970 STDOUT terraform:           + "Name"        = "dev-apps-tg-rule"
10:03:37.970 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + tags_all     = {
10:03:37.970 STDOUT terraform:           + "Environment" = "dev"
10:03:37.970 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.970 STDOUT terraform:           + "Name"        = "dev-apps-tg-rule"
10:03:37.970 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + action {
10:03:37.970 STDOUT terraform:           + order            = (known after apply)
10:03:37.970 STDOUT terraform:           + target_group_arn = (known after apply)
10:03:37.970 STDOUT terraform:           + type             = "forward"
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + condition {
10:03:37.970 STDOUT terraform:           + host_header {
10:03:37.970 STDOUT terraform:               + regex_values = []
10:03:37.970 STDOUT terraform:               + values       = [
10:03:37.970 STDOUT terraform:                   + "*.dev.example.com",
10:03:37.970 STDOUT terraform:                 ]
10:03:37.970 STDOUT terraform:             }
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:     }
10:03:37.970 STDOUT terraform:   # module.vpc.aws_lb_listener_rule.clusters["mgmt"] will be created
10:03:37.970 STDOUT terraform:   + resource "aws_lb_listener_rule" "clusters" {
10:03:37.970 STDOUT terraform:       + arn          = (known after apply)
10:03:37.970 STDOUT terraform:       + id           = (known after apply)
10:03:37.970 STDOUT terraform:       + listener_arn = (known after apply)
10:03:37.970 STDOUT terraform:       + priority     = 100
10:03:37.970 STDOUT terraform:       + region       = "eu-west-1"
10:03:37.970 STDOUT terraform:       + tags         = {
10:03:37.970 STDOUT terraform:           + "Environment" = "dev"
10:03:37.970 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.970 STDOUT terraform:           + "Name"        = "dev-mgmt-tg-rule"
10:03:37.970 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + tags_all     = {
10:03:37.970 STDOUT terraform:           + "Environment" = "dev"
10:03:37.970 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.970 STDOUT terraform:           + "Name"        = "dev-mgmt-tg-rule"
10:03:37.970 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + action {
10:03:37.970 STDOUT terraform:           + order            = (known after apply)
10:03:37.970 STDOUT terraform:           + target_group_arn = (known after apply)
10:03:37.970 STDOUT terraform:           + type             = "forward"
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:       + condition {
10:03:37.970 STDOUT terraform:           + host_header {
10:03:37.970 STDOUT terraform:               + regex_values = []
10:03:37.970 STDOUT terraform:               + values       = [
10:03:37.970 STDOUT terraform:                   + "argocd.dev.example.com",
10:03:37.970 STDOUT terraform:                 ]
10:03:37.970 STDOUT terraform:             }
10:03:37.970 STDOUT terraform:         }
10:03:37.970 STDOUT terraform:     }
10:03:37.970 STDOUT terraform:   # module.vpc.aws_lb_target_group.clusters["apps"] will be created
10:03:37.971 STDOUT terraform:   + resource "aws_lb_target_group" "clusters" {
10:03:37.971 STDOUT terraform:       + arn                                = (known after apply)
10:03:37.971 STDOUT terraform:       + arn_suffix                         = (known after apply)
10:03:37.971 STDOUT terraform:       + connection_termination             = (known after apply)
10:03:37.971 STDOUT terraform:       + deregistration_delay               = "300"
10:03:37.971 STDOUT terraform:       + id                                 = (known after apply)
10:03:37.971 STDOUT terraform:       + ip_address_type                    = (known after apply)
10:03:37.971 STDOUT terraform:       + lambda_multi_value_headers_enabled = false
10:03:37.971 STDOUT terraform:       + load_balancer_arns                 = (known after apply)
10:03:37.971 STDOUT terraform:       + load_balancing_algorithm_type      = (known after apply)
10:03:37.971 STDOUT terraform:       + load_balancing_anomaly_mitigation  = (known after apply)
10:03:37.971 STDOUT terraform:       + load_balancing_cross_zone_enabled  = (known after apply)
10:03:37.971 STDOUT terraform:       + name                               = "dev-apps-tg"
10:03:37.971 STDOUT terraform:       + name_prefix                        = (known after apply)
10:03:37.971 STDOUT terraform:       + port                               = 80
10:03:37.971 STDOUT terraform:       + preserve_client_ip                 = (known after apply)
10:03:37.971 STDOUT terraform:       + protocol                           = "HTTP"
10:03:37.971 STDOUT terraform:       + protocol_version                   = (known after apply)
10:03:37.971 STDOUT terraform:       + proxy_protocol_v2                  = false
10:03:37.971 STDOUT terraform:       + region                             = "eu-west-1"
10:03:37.971 STDOUT terraform:       + slow_start                         = 0
10:03:37.971 STDOUT terraform:       + tags                               = {
10:03:37.971 STDOUT terraform:           + "Environment" = "dev"
10:03:37.971 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.971 STDOUT terraform:           + "Name"        = "dev-apps-tg"
10:03:37.971 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.971 STDOUT terraform:         }
10:03:37.971 STDOUT terraform:       + tags_all                           = {
10:03:37.971 STDOUT terraform:           + "Environment" = "dev"
10:03:37.971 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.971 STDOUT terraform:           + "Name"        = "dev-apps-tg"
10:03:37.971 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.971 STDOUT terraform:         }
10:03:37.971 STDOUT terraform:       + target_type                        = "ip"
10:03:37.971 STDOUT terraform:       + vpc_id                             = (known after apply)
10:03:37.971 STDOUT terraform:       + health_check {
10:03:37.971 STDOUT terraform:           + enabled             = true
10:03:37.971 STDOUT terraform:           + healthy_threshold   = 2
10:03:37.971 STDOUT terraform:           + interval            = 30
10:03:37.971 STDOUT terraform:           + matcher             = "200"
10:03:37.971 STDOUT terraform:           + path                = "/healthz"
10:03:37.971 STDOUT terraform:           + port                = "traffic-port"
10:03:37.971 STDOUT terraform:           + protocol            = "HTTP"
10:03:37.971 STDOUT terraform:           + timeout             = 5
10:03:37.971 STDOUT terraform:           + unhealthy_threshold = 2
10:03:37.971 STDOUT terraform:         }
10:03:37.971 STDOUT terraform:       + stickiness (known after apply)
10:03:37.971 STDOUT terraform:       + target_failover (known after apply)
10:03:37.971 STDOUT terraform:       + target_group_health (known after apply)
10:03:37.971 STDOUT terraform:       + target_health_state (known after apply)
10:03:37.971 STDOUT terraform:     }
10:03:37.971 STDOUT terraform:   # module.vpc.aws_lb_target_group.clusters["mgmt"] will be created
10:03:37.971 STDOUT terraform:   + resource "aws_lb_target_group" "clusters" {
10:03:37.971 STDOUT terraform:       + arn                                = (known after apply)
10:03:37.971 STDOUT terraform:       + arn_suffix                         = (known after apply)
10:03:37.971 STDOUT terraform:       + connection_termination             = (known after apply)
10:03:37.971 STDOUT terraform:       + deregistration_delay               = "300"
10:03:37.971 STDOUT terraform:       + id                                 = (known after apply)
10:03:37.971 STDOUT terraform:       + ip_address_type                    = (known after apply)
10:03:37.971 STDOUT terraform:       + lambda_multi_value_headers_enabled = false
10:03:37.971 STDOUT terraform:       + load_balancer_arns                 = (known after apply)
10:03:37.971 STDOUT terraform:       + load_balancing_algorithm_type      = (known after apply)
10:03:37.971 STDOUT terraform:       + load_balancing_anomaly_mitigation  = (known after apply)
10:03:37.972 STDOUT terraform:       + load_balancing_cross_zone_enabled  = (known after apply)
10:03:37.972 STDOUT terraform:       + name                               = "dev-mgmt-tg"
10:03:37.972 STDOUT terraform:       + name_prefix                        = (known after apply)
10:03:37.972 STDOUT terraform:       + port                               = 80
10:03:37.972 STDOUT terraform:       + preserve_client_ip                 = (known after apply)
10:03:37.972 STDOUT terraform:       + protocol                           = "HTTP"
10:03:37.972 STDOUT terraform:       + protocol_version                   = (known after apply)
10:03:37.972 STDOUT terraform:       + proxy_protocol_v2                  = false
10:03:37.972 STDOUT terraform:       + region                             = "eu-west-1"
10:03:37.972 STDOUT terraform:       + slow_start                         = 0
10:03:37.972 STDOUT terraform:       + tags                               = {
10:03:37.972 STDOUT terraform:           + "Environment" = "dev"
10:03:37.972 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.972 STDOUT terraform:           + "Name"        = "dev-mgmt-tg"
10:03:37.972 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.972 STDOUT terraform:         }
10:03:37.972 STDOUT terraform:       + tags_all                           = {
10:03:37.972 STDOUT terraform:           + "Environment" = "dev"
10:03:37.972 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.972 STDOUT terraform:           + "Name"        = "dev-mgmt-tg"
10:03:37.972 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.972 STDOUT terraform:         }
10:03:37.972 STDOUT terraform:       + target_type                        = "ip"
10:03:37.972 STDOUT terraform:       + vpc_id                             = (known after apply)
10:03:37.972 STDOUT terraform:       + health_check {
10:03:37.972 STDOUT terraform:           + enabled             = true
10:03:37.972 STDOUT terraform:           + healthy_threshold   = 2
10:03:37.972 STDOUT terraform:           + interval            = 30
10:03:37.972 STDOUT terraform:           + matcher             = "200"
10:03:37.972 STDOUT terraform:           + path                = "/healthz"
10:03:37.972 STDOUT terraform:           + port                = "traffic-port"
10:03:37.972 STDOUT terraform:           + protocol            = "HTTP"
10:03:37.972 STDOUT terraform:           + timeout             = 5
10:03:37.972 STDOUT terraform:           + unhealthy_threshold = 2
10:03:37.972 STDOUT terraform:         }
10:03:37.972 STDOUT terraform:       + stickiness (known after apply)
10:03:37.972 STDOUT terraform:       + target_failover (known after apply)
10:03:37.972 STDOUT terraform:       + target_group_health (known after apply)
10:03:37.972 STDOUT terraform:       + target_health_state (known after apply)
10:03:37.972 STDOUT terraform:     }
10:03:37.972 STDOUT terraform:   # module.vpc.aws_nat_gateway.main will be created
10:03:37.972 STDOUT terraform:   + resource "aws_nat_gateway" "main" {
10:03:37.972 STDOUT terraform:       + allocation_id                      = (known after apply)
10:03:37.972 STDOUT terraform:       + association_id                     = (known after apply)
10:03:37.972 STDOUT terraform:       + auto_provision_zones               = (known after apply)
10:03:37.972 STDOUT terraform:       + auto_scaling_ips                   = (known after apply)
10:03:37.972 STDOUT terraform:       + availability_mode                  = (known after apply)
10:03:37.972 STDOUT terraform:       + connectivity_type                  = "public"
10:03:37.972 STDOUT terraform:       + id                                 = (known after apply)
10:03:37.972 STDOUT terraform:       + network_interface_id               = (known after apply)
10:03:37.972 STDOUT terraform:       + private_ip                         = (known after apply)
10:03:37.972 STDOUT terraform:       + public_ip                          = (known after apply)
10:03:37.972 STDOUT terraform:       + region                             = "eu-west-1"
10:03:37.972 STDOUT terraform:       + regional_nat_gateway_address       = (known after apply)
10:03:37.972 STDOUT terraform:       + regional_nat_gateway_auto_mode     = (known after apply)
10:03:37.972 STDOUT terraform:       + route_table_id                     = (known after apply)
10:03:37.972 STDOUT terraform:       + secondary_allocation_ids           = (known after apply)
10:03:37.972 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
10:03:37.972 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
10:03:37.972 STDOUT terraform:       + subnet_id                          = (known after apply)
10:03:37.972 STDOUT terraform:       + tags                               = {
10:03:37.972 STDOUT terraform:           + "Environment" = "dev"
10:03:37.972 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.973 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat"
10:03:37.973 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.973 STDOUT terraform:         }
10:03:37.973 STDOUT terraform:       + tags_all                           = {
10:03:37.973 STDOUT terraform:           + "Environment" = "dev"
10:03:37.973 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.973 STDOUT terraform:           + "Name"        = "dev-shared-vpc-nat"
10:03:37.973 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.973 STDOUT terraform:         }
10:03:37.973 STDOUT terraform:       + vpc_id                             = (known after apply)
10:03:37.973 STDOUT terraform:     }
10:03:37.973 STDOUT terraform:   # module.vpc.aws_route_table.private will be created
10:03:37.973 STDOUT terraform:   + resource "aws_route_table" "private" {
10:03:37.973 STDOUT terraform:       + arn              = (known after apply)
10:03:37.973 STDOUT terraform:       + id               = (known after apply)
10:03:37.973 STDOUT terraform:       + owner_id         = (known after apply)
10:03:37.973 STDOUT terraform:       + propagating_vgws = (known after apply)
10:03:37.973 STDOUT terraform:       + region           = "eu-west-1"
10:03:37.973 STDOUT terraform:       + route            = [
10:03:37.973 STDOUT terraform:           + {
10:03:37.973 STDOUT terraform:               + cidr_block                 = "0.0.0.0/0"
10:03:37.973 STDOUT terraform:               + nat_gateway_id             = (known after apply)
10:03:37.973 STDOUT terraform:                 # (11 unchanged attributes hidden)
10:03:37.973 STDOUT terraform:             },
10:03:37.973 STDOUT terraform:         ]
10:03:37.973 STDOUT terraform:       + tags             = {
10:03:37.973 STDOUT terraform:           + "Environment" = "dev"
10:03:37.973 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.973 STDOUT terraform:           + "Name"        = "dev-shared-vpc-private-rt"
10:03:37.973 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.973 STDOUT terraform:         }
10:03:37.973 STDOUT terraform:       + tags_all         = {
10:03:37.973 STDOUT terraform:           + "Environment" = "dev"
10:03:37.973 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.973 STDOUT terraform:           + "Name"        = "dev-shared-vpc-private-rt"
10:03:37.973 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.973 STDOUT terraform:         }
10:03:37.973 STDOUT terraform:       + vpc_id           = (known after apply)
10:03:37.973 STDOUT terraform:     }
10:03:37.973 STDOUT terraform:   # module.vpc.aws_route_table.public will be created
10:03:37.973 STDOUT terraform:   + resource "aws_route_table" "public" {
10:03:37.973 STDOUT terraform:       + arn              = (known after apply)
10:03:37.973 STDOUT terraform:       + id               = (known after apply)
10:03:37.973 STDOUT terraform:       + owner_id         = (known after apply)
10:03:37.973 STDOUT terraform:       + propagating_vgws = (known after apply)
10:03:37.973 STDOUT terraform:       + region           = "eu-west-1"
10:03:37.973 STDOUT terraform:       + route            = [
10:03:37.973 STDOUT terraform:           + {
10:03:37.973 STDOUT terraform:               + cidr_block                 = "0.0.0.0/0"
10:03:37.973 STDOUT terraform:               + gateway_id                 = (known after apply)
10:03:37.973 STDOUT terraform:                 # (11 unchanged attributes hidden)
10:03:37.973 STDOUT terraform:             },
10:03:37.973 STDOUT terraform:         ]
10:03:37.973 STDOUT terraform:       + tags             = {
10:03:37.973 STDOUT terraform:           + "Environment" = "dev"
10:03:37.973 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.973 STDOUT terraform:           + "Name"        = "dev-shared-vpc-public-rt"
10:03:37.973 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.973 STDOUT terraform:         }
10:03:37.973 STDOUT terraform:       + tags_all         = {
10:03:37.973 STDOUT terraform:           + "Environment" = "dev"
10:03:37.973 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.973 STDOUT terraform:           + "Name"        = "dev-shared-vpc-public-rt"
10:03:37.973 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.973 STDOUT terraform:         }
10:03:37.973 STDOUT terraform:       + vpc_id           = (known after apply)
10:03:37.973 STDOUT terraform:     }
10:03:37.973 STDOUT terraform:   # module.vpc.aws_route_table_association.private["eu-west-1a"] will be created
10:03:37.973 STDOUT terraform:   + resource "aws_route_table_association" "private" {
10:03:37.973 STDOUT terraform:       + id             = (known after apply)
10:03:37.973 STDOUT terraform:       + region         = "eu-west-1"
10:03:37.973 STDOUT terraform:       + route_table_id = (known after apply)
10:03:37.973 STDOUT terraform:       + subnet_id      = (known after apply)
10:03:37.973 STDOUT terraform:     }
10:03:37.973 STDOUT terraform:   # module.vpc.aws_route_table_association.private["eu-west-1b"] will be created
10:03:37.973 STDOUT terraform:   + resource "aws_route_table_association" "private" {
10:03:37.974 STDOUT terraform:       + id             = (known after apply)
10:03:37.974 STDOUT terraform:       + region         = "eu-west-1"
10:03:37.974 STDOUT terraform:       + route_table_id = (known after apply)
10:03:37.974 STDOUT terraform:       + subnet_id      = (known after apply)
10:03:37.974 STDOUT terraform:     }
10:03:37.974 STDOUT terraform:   # module.vpc.aws_route_table_association.public["eu-west-1a"] will be created
10:03:37.974 STDOUT terraform:   + resource "aws_route_table_association" "public" {
10:03:37.974 STDOUT terraform:       + id             = (known after apply)
10:03:37.974 STDOUT terraform:       + region         = "eu-west-1"
10:03:37.974 STDOUT terraform:       + route_table_id = (known after apply)
10:03:37.974 STDOUT terraform:       + subnet_id      = (known after apply)
10:03:37.974 STDOUT terraform:     }
10:03:37.974 STDOUT terraform:   # module.vpc.aws_route_table_association.public["eu-west-1b"] will be created
10:03:37.974 STDOUT terraform:   + resource "aws_route_table_association" "public" {
10:03:37.974 STDOUT terraform:       + id             = (known after apply)
10:03:37.974 STDOUT terraform:       + region         = "eu-west-1"
10:03:37.974 STDOUT terraform:       + route_table_id = (known after apply)
10:03:37.974 STDOUT terraform:       + subnet_id      = (known after apply)
10:03:37.974 STDOUT terraform:     }
10:03:37.974 STDOUT terraform:   # module.vpc.aws_security_group.alb[0] will be created
10:03:37.974 STDOUT terraform:   + resource "aws_security_group" "alb" {
10:03:37.974 STDOUT terraform:       + arn                    = (known after apply)
10:03:37.974 STDOUT terraform:       + description            = "Security group for shared Application Load Balancer"
10:03:37.974 STDOUT terraform:       + egress                 = [
10:03:37.974 STDOUT terraform:           + {
10:03:37.974 STDOUT terraform:               + cidr_blocks      = [
10:03:37.974 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.974 STDOUT terraform:                 ]
10:03:37.974 STDOUT terraform:               + description      = "Allow all outbound"
10:03:37.974 STDOUT terraform:               + from_port        = 0
10:03:37.974 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.974 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.974 STDOUT terraform:               + protocol         = "-1"
10:03:37.974 STDOUT terraform:               + security_groups  = []
10:03:37.974 STDOUT terraform:               + self             = false
10:03:37.974 STDOUT terraform:               + to_port          = 0
10:03:37.974 STDOUT terraform:             },
10:03:37.974 STDOUT terraform:         ]
10:03:37.974 STDOUT terraform:       + id                     = (known after apply)
10:03:37.974 STDOUT terraform:       + ingress                = [
10:03:37.974 STDOUT terraform:           + {
10:03:37.974 STDOUT terraform:               + cidr_blocks      = [
10:03:37.974 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.974 STDOUT terraform:                 ]
10:03:37.974 STDOUT terraform:               + description      = "HTTP from internet"
10:03:37.974 STDOUT terraform:               + from_port        = 80
10:03:37.974 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.974 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.974 STDOUT terraform:               + protocol         = "tcp"
10:03:37.974 STDOUT terraform:               + security_groups  = []
10:03:37.974 STDOUT terraform:               + self             = false
10:03:37.974 STDOUT terraform:               + to_port          = 80
10:03:37.974 STDOUT terraform:             },
10:03:37.974 STDOUT terraform:           + {
10:03:37.974 STDOUT terraform:               + cidr_blocks      = [
10:03:37.974 STDOUT terraform:                   + "0.0.0.0/0",
10:03:37.974 STDOUT terraform:                 ]
10:03:37.974 STDOUT terraform:               + description      = "HTTPS from internet"
10:03:37.974 STDOUT terraform:               + from_port        = 443
10:03:37.974 STDOUT terraform:               + ipv6_cidr_blocks = []
10:03:37.974 STDOUT terraform:               + prefix_list_ids  = []
10:03:37.974 STDOUT terraform:               + protocol         = "tcp"
10:03:37.974 STDOUT terraform:               + security_groups  = []
10:03:37.974 STDOUT terraform:               + self             = false
10:03:37.974 STDOUT terraform:               + to_port          = 443
10:03:37.974 STDOUT terraform:             },
10:03:37.974 STDOUT terraform:         ]
10:03:37.974 STDOUT terraform:       + name                   = "dev-shared-vpc-alb-sg"
10:03:37.974 STDOUT terraform:       + name_prefix            = (known after apply)
10:03:37.974 STDOUT terraform:       + owner_id               = (known after apply)
10:03:37.974 STDOUT terraform:       + region                 = "eu-west-1"
10:03:37.974 STDOUT terraform:       + revoke_rules_on_delete = false
10:03:37.974 STDOUT terraform:       + tags                   = {
10:03:37.974 STDOUT terraform:           + "Environment" = "dev"
10:03:37.974 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.974 STDOUT terraform:           + "Name"        = "dev-shared-vpc-alb-sg"
10:03:37.974 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.975 STDOUT terraform:         }
10:03:37.975 STDOUT terraform:       + tags_all               = {
10:03:37.975 STDOUT terraform:           + "Environment" = "dev"
10:03:37.975 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.975 STDOUT terraform:           + "Name"        = "dev-shared-vpc-alb-sg"
10:03:37.975 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.975 STDOUT terraform:         }
10:03:37.975 STDOUT terraform:       + vpc_id                 = (known after apply)
10:03:37.975 STDOUT terraform:     }
10:03:37.975 STDOUT terraform:   # module.vpc.aws_subnet.private["eu-west-1a"] will be created
10:03:37.975 STDOUT terraform:   + resource "aws_subnet" "private" {
10:03:37.975 STDOUT terraform:       + arn                                            = (known after apply)
10:03:37.975 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:03:37.975 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
10:03:37.975 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:03:37.975 STDOUT terraform:       + cidr_block                                     = "10.0.11.0/24"
10:03:37.975 STDOUT terraform:       + enable_dns64                                   = false
10:03:37.975 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:03:37.975 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:03:37.975 STDOUT terraform:       + id                                             = (known after apply)
10:03:37.975 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
10:03:37.975 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:03:37.975 STDOUT terraform:       + ipv6_native                                    = false
10:03:37.975 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:03:37.975 STDOUT terraform:       + owner_id                                       = (known after apply)
10:03:37.975 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:03:37.975 STDOUT terraform:       + region                                         = "eu-west-1"
10:03:37.975 STDOUT terraform:       + tags                                           = {
10:03:37.975 STDOUT terraform:           + "Environment"                     = "dev"
10:03:37.975 STDOUT terraform:           + "ManagedBy"                       = "terraform"
10:03:37.975 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1a"
10:03:37.975 STDOUT terraform:           + "Project"                         = "platform-foundation"
10:03:37.975 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
10:03:37.975 STDOUT terraform:         }
10:03:37.975 STDOUT terraform:       + tags_all                                       = {
10:03:37.975 STDOUT terraform:           + "Environment"                     = "dev"
10:03:37.975 STDOUT terraform:           + "ManagedBy"                       = "terraform"
10:03:37.975 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1a"
10:03:37.975 STDOUT terraform:           + "Project"                         = "platform-foundation"
10:03:37.975 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
10:03:37.975 STDOUT terraform:         }
10:03:37.975 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:03:37.975 STDOUT terraform:     }
10:03:37.975 STDOUT terraform:   # module.vpc.aws_subnet.private["eu-west-1b"] will be created
10:03:37.975 STDOUT terraform:   + resource "aws_subnet" "private" {
10:03:37.975 STDOUT terraform:       + arn                                            = (known after apply)
10:03:37.975 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:03:37.975 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
10:03:37.975 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:03:37.975 STDOUT terraform:       + cidr_block                                     = "10.0.12.0/24"
10:03:37.975 STDOUT terraform:       + enable_dns64                                   = false
10:03:37.975 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:03:37.975 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:03:37.975 STDOUT terraform:       + id                                             = (known after apply)
10:03:37.975 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
10:03:37.976 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:03:37.976 STDOUT terraform:       + ipv6_native                                    = false
10:03:37.976 STDOUT terraform:       + map_public_ip_on_launch                        = false
10:03:37.976 STDOUT terraform:       + owner_id                                       = (known after apply)
10:03:37.976 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:03:37.976 STDOUT terraform:       + region                                         = "eu-west-1"
10:03:37.976 STDOUT terraform:       + tags                                           = {
10:03:37.976 STDOUT terraform:           + "Environment"                     = "dev"
10:03:37.976 STDOUT terraform:           + "ManagedBy"                       = "terraform"
10:03:37.976 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1b"
10:03:37.976 STDOUT terraform:           + "Project"                         = "platform-foundation"
10:03:37.976 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
10:03:37.976 STDOUT terraform:         }
10:03:37.976 STDOUT terraform:       + tags_all                                       = {
10:03:37.976 STDOUT terraform:           + "Environment"                     = "dev"
10:03:37.976 STDOUT terraform:           + "ManagedBy"                       = "terraform"
10:03:37.976 STDOUT terraform:           + "Name"                            = "dev-shared-vpc-private-eu-west-1b"
10:03:37.976 STDOUT terraform:           + "Project"                         = "platform-foundation"
10:03:37.976 STDOUT terraform:           + "kubernetes.io/role/internal-elb" = "1"
10:03:37.976 STDOUT terraform:         }
10:03:37.976 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:03:37.976 STDOUT terraform:     }
10:03:37.976 STDOUT terraform:   # module.vpc.aws_subnet.public["eu-west-1a"] will be created
10:03:37.976 STDOUT terraform:   + resource "aws_subnet" "public" {
10:03:37.976 STDOUT terraform:       + arn                                            = (known after apply)
10:03:37.976 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:03:37.976 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
10:03:37.976 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:03:37.976 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
10:03:37.976 STDOUT terraform:       + enable_dns64                                   = false
10:03:37.976 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:03:37.976 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:03:37.976 STDOUT terraform:       + id                                             = (known after apply)
10:03:37.976 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
10:03:37.976 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:03:37.976 STDOUT terraform:       + ipv6_native                                    = false
10:03:37.976 STDOUT terraform:       + map_public_ip_on_launch                        = true
10:03:37.976 STDOUT terraform:       + owner_id                                       = (known after apply)
10:03:37.976 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:03:37.976 STDOUT terraform:       + region                                         = "eu-west-1"
10:03:37.976 STDOUT terraform:       + tags                                           = {
10:03:37.976 STDOUT terraform:           + "Environment"            = "dev"
10:03:37.976 STDOUT terraform:           + "ManagedBy"              = "terraform"
10:03:37.976 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1a"
10:03:37.976 STDOUT terraform:           + "Project"                = "platform-foundation"
10:03:37.976 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
10:03:37.976 STDOUT terraform:         }
10:03:37.976 STDOUT terraform:       + tags_all                                       = {
10:03:37.976 STDOUT terraform:           + "Environment"            = "dev"
10:03:37.976 STDOUT terraform:           + "ManagedBy"              = "terraform"
10:03:37.976 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1a"
10:03:37.976 STDOUT terraform:           + "Project"                = "platform-foundation"
10:03:37.976 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
10:03:37.977 STDOUT terraform:         }
10:03:37.977 STDOUT terraform:       + vpc_id          
10:03:37.977 STDOUT terraform:                                = (known after apply)
10:03:37.977 STDOUT terraform:     }
10:03:37.977 STDOUT terraform:   # module.vpc.aws_subnet.public["eu-west-1b"] will be created
10:03:37.977 STDOUT terraform:   + resource "aws_subnet" "public" {
10:03:37.977 STDOUT terraform:       + arn                                            = (known after apply)
10:03:37.977 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
10:03:37.977 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
10:03:37.977 STDOUT terraform:       + availability_zone_id                           = (known after apply)
10:03:37.977 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
10:03:37.977 STDOUT terraform:       + enable_dns64                                   = false
10:03:37.977 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
10:03:37.977 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:03:37.977 STDOUT terraform:       + id                                             = (known after apply)
10:03:37.977 STDOUT terraform:       + ipv6_cidr_block                                = (known after apply)
10:03:37.977 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
10:03:37.977 STDOUT terraform:       + ipv6_native                                    = false
10:03:37.977 STDOUT terraform:       + map_public_ip_on_launch                        = true
10:03:37.977 STDOUT terraform:       + owner_id                                       = (known after apply)
10:03:37.977 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
10:03:37.977 STDOUT terraform:       + region                                         = "eu-west-1"
10:03:37.977 STDOUT terraform:       + tags                                           = {
10:03:37.977 STDOUT terraform:           + "Environment"            = "dev"
10:03:37.977 STDOUT terraform:           + "ManagedBy"              = "terraform"
10:03:37.977 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1b"
10:03:37.977 STDOUT terraform:           + "Project"                = "platform-foundation"
10:03:37.977 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
10:03:37.977 STDOUT terraform:         }
10:03:37.977 STDOUT terraform:       + tags_all                                       = {
10:03:37.977 STDOUT terraform:           + "Environment"            = "dev"
10:03:37.977 STDOUT terraform:           + "ManagedBy"              = "terraform"
10:03:37.977 STDOUT terraform:           + "Name"                   = "dev-shared-vpc-public-eu-west-1b"
10:03:37.977 STDOUT terraform:           + "Project"                = "platform-foundation"
10:03:37.977 STDOUT terraform:           + "kubernetes.io/role/elb" = "1"
10:03:37.977 STDOUT terraform:         }
10:03:37.977 STDOUT terraform:       + vpc_id                                         = (known after apply)
10:03:37.977 STDOUT terraform:     }
10:03:37.977 STDOUT terraform:   # module.vpc.aws_vpc.main will be created
10:03:37.977 STDOUT terraform:   + resource "aws_vpc" "main" {
10:03:37.977 STDOUT terraform:       + arn                                  = (known after apply)
10:03:37.977 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
10:03:37.977 STDOUT terraform:       + default_network_acl_id               = (known after apply)
10:03:37.977 STDOUT terraform:       + default_route_table_id               = (known after apply)
10:03:37.977 STDOUT terraform:       + default_security_group_id            = (known after apply)
10:03:37.977 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
10:03:37.977 STDOUT terraform:       + enable_dns_hostnames                 = true
10:03:37.977 STDOUT terraform:       + enable_dns_support                   = true
10:03:37.977 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
10:03:37.977 STDOUT terraform:       + id                                   = (known after apply)
10:03:37.977 STDOUT terraform:       + instance_tenancy                     = "default"
10:03:37.977 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
10:03:37.977 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
10:03:37.977 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
10:03:37.977 STDOUT terraform:       + main_route_table_id                  = (known after apply)
10:03:37.978 STDOUT terraform:       + owner_id                             = (known after apply)
10:03:37.978 STDOUT terraform:       + region                               = "eu-west-1"
10:03:37.978 STDOUT terraform:       + tags                                 = {
10:03:37.978 STDOUT terraform:           + "Environment" = "dev"
10:03:37.978 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.978 STDOUT terraform:           + "Name"        = "dev-shared-vpc"
10:03:37.978 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.978 STDOUT terraform:         }
10:03:37.978 STDOUT terraform:       + tags_all                             = {
10:03:37.978 STDOUT terraform:           + "Environment" = "dev"
10:03:37.978 STDOUT terraform:           + "ManagedBy"   = "terraform"
10:03:37.978 STDOUT terraform:           + "Name"        = "dev-shared-vpc"
10:03:37.978 STDOUT terraform:           + "Project"     = "platform-foundation"
10:03:37.978 STDOUT terraform:         }
10:03:37.978 STDOUT terraform:     }
10:03:37.978 STDOUT terraform: Plan: 52 to add, 0 to change, 0 to destroy.
10:03:37.978 STDOUT terraform: Changes to Outputs:
10:03:37.978 STDOUT terraform:   + alb_dns_name              = (known after apply)
10:03:37.978 STDOUT terraform:   + eks_apps_cluster_endpoint = (known after apply)
10:03:37.978 STDOUT terraform:   + eks_mgmt_cluster_endpoint = (known after apply)
10:03:37.978 STDOUT terraform:   + vpc_id                    = (known after apply)

```

</details>

---
**Plan artifact:** `tfplan-3-52fa79b0205e0f73d8cdce8bea16e77044062329` (7-day GitHub retention)
**Plan S3 location:** `s3://iac-foundation-tf-state/terraform-plans/3/52fa79b0205e0f73d8cdce8bea16e77044062329/` (14-day S3 lifecycle)
**Note:**
- Plans with changes stored in both GitHub artifacts (7d) and S3 (14d).
- Plans with no changes don't generate binary files (nothing to apply).
- Infrastructure uses environment parameterization (dev.tfvars).

**Deployment order:** Organizations (manual) → GitHub OIDC → Dev Infrastructure
**Organizations:** Managed locally with admin credentials for security.
*Pusher: @richardnpaul, Action: `pull_request`, Workflow: `Terraform Deployment`*